[NoCoverage] BlockStatement
src/api/deliveries/delivery.controller.ts:45:24
   })
   async createDelivery(
     @Body() createDeliveryDto: CreateDeliveryDTO,
-  ): Promise<Delivery> {
-    return await this.deliveryService.createDelivery(createDeliveryDto);
-  }
+  ): Promise<Delivery> {}
 
   @UserAction(Action.FIND_DELIVERY)

[NoCoverage] BlockStatement
src/api/deliveries/delivery.controller.ts:56:69
   @ApiOkResponse({
     type: DeliveryDto,
   })
-  async getDeliveryById(@Param('id') id: string): Promise<Delivery> {
-    return await this.deliveryService.getDeliveryById(id);
-  }
+  async getDeliveryById(@Param('id') id: string): Promise<Delivery> {}
 
   @UserAction(Action.UPDATE_DELIVERY)

[NoCoverage] BlockStatement
src/api/deliveries/delivery.controller.ts:70:24
   async updateDelivery(
     @Param('id') id: string,
     @Body() updateDeliveryDto: UpdateDeliveryDTO,
-  ): Promise<Delivery> {
-    return await this.deliveryService.updateDelivery(id, updateDeliveryDto);
-  }
+  ): Promise<Delivery> {}
 
   @UserAction(Action.DELETE_DELIVERY)

[NoCoverage] BlockStatement
src/api/deliveries/delivery.controller.ts:87:79
       },
     },
   })
-  async deleteDelivery(@Param('id') id: string): Promise<{ message: string }> {
-    return await this.deliveryService.deleteDelivery(id);
-  }
+  async deleteDelivery(@Param('id') id: string): Promise<{ message: string }> {}
 
   @UserAction(Action.FIND_DELIVERIES)

[NoCoverage] BlockStatement
src/api/deliveries/delivery.controller.ts:100:51
   })
   async getAllDeliveries(
     @Query() query: FindDeliveriesParamsDTO,
-  ): Promise<{ data: Delivery[]; total: number }> {
-    return await this.deliveryService.getAllDeliveries(query);
-  }
+  ): Promise<{ data: Delivery[]; total: number }> {}
 }
 
