[Survived] BlockStatement
src/api/auth/auth.service.ts:27:5
     private readonly jwtService: JwtService,
     private readonly config: ConfigService,
     private readonly userService: UserService,
-  ) {
-    this.authConfig = this.config.get<AuthConfig>('auth');
-  }
+  ) {}
 
   async verifyToken(token: string): Promise<JwtPayload> {

[Killed] BlockStatement
src/api/auth/auth.service.ts:31:57
     this.authConfig = this.config.get<AuthConfig>('auth');
   }
 
-  async verifyToken(token: string): Promise<JwtPayload> {
-    const payload: JwtPayload = await this.jwtService
-      .verifyAsync(token)
-      .catch(() => {
-        throw new BadRequestException({ message: 'Invalid token' });
-      });
-    return payload;
-  }
+  async verifyToken(token: string): Promise<JwtPayload> {}
 
   async refreshTokens(refreshToken: string) {
killedBy: AuthService verifyToken should return payload for a valid token
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "sub": "user-id"}
Received: undefined

[Killed] BlockStatement
src/api/auth/auth.service.ts:34:20
   async verifyToken(token: string): Promise<JwtPayload> {
     const payload: JwtPayload = await this.jwtService
       .verifyAsync(token)
-      .catch(() => {
-        throw new BadRequestException({ message: 'Invalid token' });
-      });
+      .catch(() => {});
     return payload;
   }
killedBy: AuthService verifyToken should throw BadRequestException for invalid token
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/api/auth/auth.service.ts:40:45
     return payload;
   }
 
-  async refreshTokens(refreshToken: string) {
-    if (!refreshToken)
-      throw new BadRequestException({ message: 'Token is required' });
-    const payload: JwtPayload = await this.verifyToken(refreshToken);
-    const creds = await this.userService.findUserCredentials({
-      email: payload.email,
-    });
-    return this.issueTokens(creds);
-  }
+  async refreshTokens(refreshToken: string) {}
 
   private issueTokens(creds: UserCredentials): {
killedBy: AuthService refreshTokens should issue new tokens for a valid refresh token
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"accessToken": "new-access-token", "refreshToken": "new-refresh-token"}
Received: undefined

[Killed] ConditionalExpression
src/api/auth/auth.service.ts:41:9
   }
 
   async refreshTokens(refreshToken: string) {
-    if (!refreshToken)
+    if (true)
       throw new BadRequestException({ message: 'Token is required' });
     const payload: JwtPayload = await this.verifyToken(refreshToken);
killedBy: AuthService refreshTokens should issue new tokens for a valid refresh token
statusReason: BadRequestException: Token is required

[Killed] BooleanLiteral
src/api/auth/auth.service.ts:41:9
   }
 
   async refreshTokens(refreshToken: string) {
-    if (!refreshToken)
+    if (refreshToken)
       throw new BadRequestException({ message: 'Token is required' });
     const payload: JwtPayload = await this.verifyToken(refreshToken);
killedBy: AuthService refreshTokens should issue new tokens for a valid refresh token
statusReason: BadRequestException: Token is required

[NoCoverage] ObjectLiteral
src/api/auth/auth.service.ts:42:37
 
   async refreshTokens(refreshToken: string) {
     if (!refreshToken)
-      throw new BadRequestException({ message: 'Token is required' });
+      throw new BadRequestException({});
     const payload: JwtPayload = await this.verifyToken(refreshToken);
     const creds = await this.userService.findUserCredentials({

[NoCoverage] BlockStatement
src/api/auth/auth.service.ts:53:5
   private issueTokens(creds: UserCredentials): {
     accessToken: string;
     refreshToken: string;
-  } {
-    const payload: JwtPayload = {
-      sub: creds.id,
-      email: creds.email,
-      createdAt: Date.now(),
-    };
-    return {
-      accessToken: this.jwtService.sign(payload),
-      refreshToken: this.jwtService.sign(payload, {
-        expiresIn: this.authConfig.refreshTtl,
-      }),
-    };
-  }
+  } {}
 
   async login(data: LogInDTO) {

[NoCoverage] ObjectLiteral
src/api/auth/auth.service.ts:59:12
       email: creds.email,
       createdAt: Date.now(),
     };
-    return {
-      accessToken: this.jwtService.sign(payload),
-      refreshToken: this.jwtService.sign(payload, {
-        expiresIn: this.authConfig.refreshTtl,
-      }),
-    };
+    return {};
   }
 

[Killed] BlockStatement
src/api/auth/auth.service.ts:67:31
     };
   }
 
-  async login(data: LogInDTO) {
-    const creds = await this.userService.findUserCredentials({
-      email: data.email,
-    });
-    const isValid =
-      creds && (await validatePassword(data.password, creds.password));
-    if (!isValid)
-      throw new UnauthorizedException({ message: 'Invalid credentials' });
-    return this.issueTokens(creds);
-  }
+  async login(data: LogInDTO) {}
 
   async changePassword(userId: string, data: ChangePasswordDTO) {
killedBy: AuthService login should return tokens for valid credentials
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"accessToken": "access-token", "refreshToken": "refresh-token"}
Received: undefined

[Killed] ObjectLiteral
src/api/auth/auth.service.ts:68:62
   }
 
   async login(data: LogInDTO) {
-    const creds = await this.userService.findUserCredentials({
-      email: data.email,
-    });
+    const creds = await this.userService.findUserCredentials({});
     const isValid =
       creds && (await validatePassword(data.password, creds.password));
killedBy: AuthService login should return tokens for valid credentials
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
- }

[Killed] ConditionalExpression
src/api/auth/auth.service.ts:72:7
       email: data.email,
     });
     const isValid =
-      creds && (await validatePassword(data.password, creds.password));
+      false;
     if (!isValid)
       throw new UnauthorizedException({ message: 'Invalid credentials' });
killedBy: AuthService login should return tokens for valid credentials
statusReason: UnauthorizedException: Invalid credentials

[Killed] LogicalOperator
src/api/auth/auth.service.ts:72:7
       email: data.email,
     });
     const isValid =
-      creds && (await validatePassword(data.password, creds.password));
+      creds || (await validatePassword(data.password, creds.password));
     if (!isValid)
       throw new UnauthorizedException({ message: 'Invalid credentials' });
killedBy: AuthService login should return tokens for valid credentials
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "password", "hashed-password"

Number of calls: 0

[Killed] ConditionalExpression
src/api/auth/auth.service.ts:73:9
     });
     const isValid =
       creds && (await validatePassword(data.password, creds.password));
-    if (!isValid)
+    if (true)
       throw new UnauthorizedException({ message: 'Invalid credentials' });
     return this.issueTokens(creds);
killedBy: AuthService login should return tokens for valid credentials
statusReason: UnauthorizedException: Invalid credentials

[Killed] ConditionalExpression
src/api/auth/auth.service.ts:73:9
     });
     const isValid =
       creds && (await validatePassword(data.password, creds.password));
-    if (!isValid)
+    if (false)
       throw new UnauthorizedException({ message: 'Invalid credentials' });
     return this.issueTokens(creds);
killedBy: AuthService login should throw UnauthorizedException for invalid credentials
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": undefined, "refreshToken": undefined}

[Survived] ObjectLiteral
src/api/auth/auth.service.ts:74:39
     const isValid =
       creds && (await validatePassword(data.password, creds.password));
     if (!isValid)
-      throw new UnauthorizedException({ message: 'Invalid credentials' });
+      throw new UnauthorizedException({});
     return this.issueTokens(creds);
   }

[Survived] StringLiteral
src/api/auth/auth.service.ts:74:50
     const isValid =
       creds && (await validatePassword(data.password, creds.password));
     if (!isValid)
-      throw new UnauthorizedException({ message: 'Invalid credentials' });
+      throw new UnauthorizedException({ message: "" });
     return this.issueTokens(creds);
   }

[NoCoverage] BlockStatement
src/api/auth/auth.service.ts:78:65
     return this.issueTokens(creds);
   }
 
-  async changePassword(userId: string, data: ChangePasswordDTO) {
-    const creds = await this.userService.findUserCredentials({
-      id: userId,
-    });
-    const isValid =
-      creds && (await validatePassword(data.oldPassword, creds.password));
-    if (!isValid)
-      throw new UnauthorizedException({ message: 'Invalid credentials' });
-    const newHashedPassword = await hashPassword(data.newPassword);
-    await this.userService.updateUser(userId, {
-      password: newHashedPassword,
-    });
-  }
+  async changePassword(userId: string, data: ChangePasswordDTO) {}
 
   async me(userId: string) {

[NoCoverage] ObjectLiteral
src/api/auth/auth.service.ts:79:62
   }
 
   async changePassword(userId: string, data: ChangePasswordDTO) {
-    const creds = await this.userService.findUserCredentials({
-      id: userId,
-    });
+    const creds = await this.userService.findUserCredentials({});
     const isValid =
       creds && (await validatePassword(data.oldPassword, creds.password));

[NoCoverage] ConditionalExpression
src/api/auth/auth.service.ts:83:7
       id: userId,
     });
     const isValid =
-      creds && (await validatePassword(data.oldPassword, creds.password));
+      true;
     if (!isValid)
       throw new UnauthorizedException({ message: 'Invalid credentials' });

[NoCoverage] ConditionalExpression
src/api/auth/auth.service.ts:83:7
       id: userId,
     });
     const isValid =
-      creds && (await validatePassword(data.oldPassword, creds.password));
+      false;
     if (!isValid)
       throw new UnauthorizedException({ message: 'Invalid credentials' });

[NoCoverage] ConditionalExpression
src/api/auth/auth.service.ts:84:9
     });
     const isValid =
       creds && (await validatePassword(data.oldPassword, creds.password));
-    if (!isValid)
+    if (true)
       throw new UnauthorizedException({ message: 'Invalid credentials' });
     const newHashedPassword = await hashPassword(data.newPassword);

[NoCoverage] BooleanLiteral
src/api/auth/auth.service.ts:84:9
     });
     const isValid =
       creds && (await validatePassword(data.oldPassword, creds.password));
-    if (!isValid)
+    if (isValid)
       throw new UnauthorizedException({ message: 'Invalid credentials' });
     const newHashedPassword = await hashPassword(data.newPassword);

[NoCoverage] BlockStatement
src/api/auth/auth.service.ts:92:28
     });
   }
 
-  async me(userId: string) {
-    const user = await this.userService.findUser(userId);
-    return user;
-  }
+  async me(userId: string) {}
 
   async verifyPermissions(

[NoCoverage] BlockStatement
src/api/auth/auth.service.ts:100:23
   async verifyPermissions(
     userId: string,
     permissions: Permissions[],
-  ): Promise<boolean> {
-    if (!permissions.length) return true;
-    try {
-      const [{ res }]: [{ res: boolean }] = await this.prisma.$queryRaw`
-        WITH perms AS (
-          SELECT P.name AS perm
-          FROM "users" U
-          JOIN "roles" R ON U.role_id = R.id
-          JOIN "role_permissions" RP ON RP.role_id = R.id
-          JOIN "permissions" P ON P.id = RP.permission_id
-          WHERE U.id = ${userId}
-        )
-        SELECT
-          ${permissions}::text[] <@ array_agg(perm) AS res
-        FROM perms;
-      `;
-      return res;
-    } catch (error) {
-      return false;
-    }
-  }
+  ): Promise<boolean> {}
 }
 

[NoCoverage] ConditionalExpression
src/api/auth/auth.service.ts:101:9
     userId: string,
     permissions: Permissions[],
   ): Promise<boolean> {
-    if (!permissions.length) return true;
+    if (false) return true;
     try {
       const [{ res }]: [{ res: boolean }] = await this.prisma.$queryRaw`

[NoCoverage] BooleanLiteral
src/api/auth/auth.service.ts:101:9
     userId: string,
     permissions: Permissions[],
   ): Promise<boolean> {
-    if (!permissions.length) return true;
+    if (permissions.length) return true;
     try {
       const [{ res }]: [{ res: boolean }] = await this.prisma.$queryRaw`

[NoCoverage] BlockStatement
src/api/auth/auth.service.ts:102:9
     permissions: Permissions[],
   ): Promise<boolean> {
     if (!permissions.length) return true;
-    try {
-      const [{ res }]: [{ res: boolean }] = await this.prisma.$queryRaw`
-        WITH perms AS (
-          SELECT P.name AS perm
-          FROM "users" U
-          JOIN "roles" R ON U.role_id = R.id
-          JOIN "role_permissions" RP ON RP.role_id = R.id
-          JOIN "permissions" P ON P.id = RP.permission_id
-          WHERE U.id = ${userId}
-        )
-        SELECT
-          ${permissions}::text[] <@ array_agg(perm) AS res
-        FROM perms;
-      `;
-      return res;
-    } catch (error) {
+    try {} catch (error) {
       return false;
     }

[NoCoverage] StringLiteral
src/api/auth/auth.service.ts:103:72
   ): Promise<boolean> {
     if (!permissions.length) return true;
     try {
-      const [{ res }]: [{ res: boolean }] = await this.prisma.$queryRaw`
-        WITH perms AS (
-          SELECT P.name AS perm
-          FROM "users" U
-          JOIN "roles" R ON U.role_id = R.id
-          JOIN "role_permissions" RP ON RP.role_id = R.id
-          JOIN "permissions" P ON P.id = RP.permission_id
-          WHERE U.id = ${userId}
-        )
-        SELECT
-          ${permissions}::text[] <@ array_agg(perm) AS res
-        FROM perms;
-      `;
+      const [{ res }]: [{ res: boolean }] = await this.prisma.$queryRaw``;
       return res;
     } catch (error) {

[NoCoverage] BlockStatement
src/api/auth/auth.service.ts:117:21
         FROM perms;
       `;
       return res;
-    } catch (error) {
-      return false;
-    }
+    } catch (error) {}
   }
 }
