[NoCoverage] ArrowFunction
src/lib/configs/auth.config.ts:3:16
 import { AuthConfig } from '../types/configs/auth';
 
-export default (): { auth: AuthConfig } => ({
-  auth: {
-    secret: process.env.JWT_SECRET,
-    accessTtl: process.env.ACCESS_TTL,
-    refreshTtl: process.env.JWT_TTL,
-  },
-});
+export default () => undefined;
 

[NoCoverage] ObjectLiteral
src/lib/configs/auth.config.ts:3:45
 import { AuthConfig } from '../types/configs/auth';
 
-export default (): { auth: AuthConfig } => ({
-  auth: {
-    secret: process.env.JWT_SECRET,
-    accessTtl: process.env.ACCESS_TTL,
-    refreshTtl: process.env.JWT_TTL,
-  },
-});
+export default (): { auth: AuthConfig } => ({});
 

[NoCoverage] ObjectLiteral
src/lib/configs/auth.config.ts:4:9
 import { AuthConfig } from '../types/configs/auth';
 
 export default (): { auth: AuthConfig } => ({
-  auth: {
-    secret: process.env.JWT_SECRET,
-    accessTtl: process.env.ACCESS_TTL,
-    refreshTtl: process.env.JWT_TTL,
-  },
+  auth: {},
 });
 
