[NoCoverage] BlockStatement
src/api/deliveries/delivery.service.ts:13:55
   private readonly logger = new Logger(DeliveryService.name);
   private readonly deliveryRepo: Prisma.DeliveryDelegate;
 
-  constructor(private readonly prisma: PrismaService) {
-    this.deliveryRepo = prisma.delivery;
-  }
+  constructor(private readonly prisma: PrismaService) {}
 
   async createDelivery(createDeliveryDto: CreateDeliveryDTO) {

[NoCoverage] BlockStatement
src/api/deliveries/delivery.service.ts:17:62
     this.deliveryRepo = prisma.delivery;
   }
 
-  async createDelivery(createDeliveryDto: CreateDeliveryDTO) {
-    const { batches, ...deliveryData } = createDeliveryDto;
-
-    const delivery = await this.deliveryRepo.create({
-      data: {
-        ...deliveryData,
-        batches: {
-          create: batches.map((batch) => ({
-            batch: { create: batch },
-          })),
-        },
-      },
-    });
-
-    this.logger.log(`Delivery created with id: ${delivery.id}`);
-    return delivery;
-  }
+  async createDelivery(createDeliveryDto: CreateDeliveryDTO) {}
 
   async getDeliveryById(id: string) {

[NoCoverage] ArrowFunction
src/api/deliveries/delivery.service.ts:24:31
       data: {
         ...deliveryData,
         batches: {
-          create: batches.map((batch) => ({
-            batch: { create: batch },
-          })),
+          create: batches.map(() => undefined),
         },
       },

[NoCoverage] BlockStatement
src/api/deliveries/delivery.service.ts:35:37
     return delivery;
   }
 
-  async getDeliveryById(id: string) {
-    const delivery = await this.deliveryRepo.findUnique({
-      where: { id },
-      include: { batches: { include: { batch: true } } },
-    });
-
-    if (!delivery)
-      throw new NotFoundException(`Delivery with ID ${id} not found`);
-
-    return delivery;
-  }
+  async getDeliveryById(id: string) {}
 
   async updateDelivery(id: string, updateDeliveryDto: UpdateDeliveryDTO) {

[NoCoverage] ObjectLiteral
src/api/deliveries/delivery.service.ts:36:57
   }
 
   async getDeliveryById(id: string) {
-    const delivery = await this.deliveryRepo.findUnique({
-      where: { id },
-      include: { batches: { include: { batch: true } } },
-    });
+    const delivery = await this.deliveryRepo.findUnique({});
 
     if (!delivery)

[NoCoverage] ObjectLiteral
src/api/deliveries/delivery.service.ts:37:14
 
   async getDeliveryById(id: string) {
     const delivery = await this.deliveryRepo.findUnique({
-      where: { id },
+      where: {},
       include: { batches: { include: { batch: true } } },
     });

[NoCoverage] BooleanLiteral
src/api/deliveries/delivery.service.ts:38:47
   async getDeliveryById(id: string) {
     const delivery = await this.deliveryRepo.findUnique({
       where: { id },
-      include: { batches: { include: { batch: true } } },
+      include: { batches: { include: { batch: false } } },
     });
 

[NoCoverage] ObjectLiteral
src/api/deliveries/delivery.service.ts:38:16
   async getDeliveryById(id: string) {
     const delivery = await this.deliveryRepo.findUnique({
       where: { id },
-      include: { batches: { include: { batch: true } } },
+      include: {},
     });
 

[NoCoverage] ConditionalExpression
src/api/deliveries/delivery.service.ts:41:9
       include: { batches: { include: { batch: true } } },
     });
 
-    if (!delivery)
+    if (true)
       throw new NotFoundException(`Delivery with ID ${id} not found`);
 

[NoCoverage] BooleanLiteral
src/api/deliveries/delivery.service.ts:41:9
       include: { batches: { include: { batch: true } } },
     });
 
-    if (!delivery)
+    if (delivery)
       throw new NotFoundException(`Delivery with ID ${id} not found`);
 

[NoCoverage] BlockStatement
src/api/deliveries/delivery.service.ts:47:74
     return delivery;
   }
 
-  async updateDelivery(id: string, updateDeliveryDto: UpdateDeliveryDTO) {
-    const delivery = await this.deliveryRepo.update({
-      where: { id },
-      data: updateDeliveryDto,
-    });
-
-    this.logger.log(`Delivery updated with id: ${delivery.id}`);
-    return delivery;
-  }
+  async updateDelivery(id: string, updateDeliveryDto: UpdateDeliveryDTO) {}
 
   async deleteDelivery(id: string) {

[NoCoverage] StringLiteral
src/api/deliveries/delivery.service.ts:53:21
       data: updateDeliveryDto,
     });
 
-    this.logger.log(`Delivery updated with id: ${delivery.id}`);
+    this.logger.log(``);
     return delivery;
   }

[NoCoverage] BlockStatement
src/api/deliveries/delivery.service.ts:57:36
     return delivery;
   }
 
-  async deleteDelivery(id: string) {
-    await this.getDeliveryById(id);
-    await this.deliveryRepo.delete({ where: { id } });
-    this.logger.log(`Delivery deleted with id: ${id}`);
-    return { message: `Delivery with id ${id} deleted successfully` };
-  }
+  async deleteDelivery(id: string) {}
 
   async getAllDeliveries(params: FindDeliveriesParamsDTO) {

[NoCoverage] ObjectLiteral
src/api/deliveries/delivery.service.ts:61:12
     await this.getDeliveryById(id);
     await this.deliveryRepo.delete({ where: { id } });
     this.logger.log(`Delivery deleted with id: ${id}`);
-    return { message: `Delivery with id ${id} deleted successfully` };
+    return {};
   }
 

[NoCoverage] StringLiteral
src/api/deliveries/delivery.service.ts:61:23
     await this.getDeliveryById(id);
     await this.deliveryRepo.delete({ where: { id } });
     this.logger.log(`Delivery deleted with id: ${id}`);
-    return { message: `Delivery with id ${id} deleted successfully` };
+    return { message: `` };
   }
 

[NoCoverage] BlockStatement
src/api/deliveries/delivery.service.ts:64:59
     return { message: `Delivery with id ${id} deleted successfully` };
   }
 
-  async getAllDeliveries(params: FindDeliveriesParamsDTO) {
-    const { page, pageSize, orderBy, orderDirection, ...filters } = params;
-
-    const deliveries = await this.deliveryRepo.findMany({
-      where: filters,
-      orderBy: {
-        [orderBy]: orderDirection,
-      },
-      skip: (page - 1) * pageSize,
-      take: pageSize,
-    });
-
-    const total = await this.deliveryRepo.count({ where: filters });
-    return {
-      data: deliveries,
-      total,
-    };
-  }
+  async getAllDeliveries(params: FindDeliveriesParamsDTO) {}
 }
 

[NoCoverage] ArithmeticOperator
src/api/deliveries/delivery.service.ts:72:14
       orderBy: {
         [orderBy]: orderDirection,
       },
-      skip: (page - 1) * pageSize,
+      skip: (page + 1) * pageSize,
       take: pageSize,
     });

[NoCoverage] ArithmeticOperator
src/api/deliveries/delivery.service.ts:72:13
       orderBy: {
         [orderBy]: orderDirection,
       },
-      skip: (page - 1) * pageSize,
+      skip: (page - 1) / pageSize,
       take: pageSize,
     });

[NoCoverage] ObjectLiteral
src/api/deliveries/delivery.service.ts:77:12
     });
 
     const total = await this.deliveryRepo.count({ where: filters });
-    return {
-      data: deliveries,
-      total,
-    };
+    return {};
   }
 }
