[NoCoverage] BlockStatement
src/api/journal/journal.controller.ts:29:62
   @ApiOkResponse({
     type: UserActionListDto,
   })
-  async findUsers(@Query() params: FindUserActionsParamsDto) {
-    return await this.journalService.findUserActions(params);
-  }
+  async findUsers(@Query() params: FindUserActionsParamsDto) {}
 }
 
