[NoCoverage] BlockStatement
src/lib/security/auth.guard.ts:18:66
     private readonly cls: ClsService<AppContext>,
   ) {}
 
-  async canActivate(context: ExecutionContext): Promise<boolean> {
-    const request = context.switchToHttp().getRequest();
-    const token = request.headers.authorization?.replace('Bearer ', '');
-    if (!token) throw new UnauthorizedException('No token provided');
-    const payload = await this.authService.verifyToken(token);
-    this.cls.set('user', {
-      id: payload.sub,
-      email: payload.email,
-    });
-    return true;
-  }
+  async canActivate(context: ExecutionContext): Promise<boolean> {}
 }
 

[NoCoverage] OptionalChaining
src/lib/security/auth.guard.ts:20:19
 
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const request = context.switchToHttp().getRequest();
-    const token = request.headers.authorization?.replace('Bearer ', '');
+    const token = request.headers.authorization.replace('Bearer ', '');
     if (!token) throw new UnauthorizedException('No token provided');
     const payload = await this.authService.verifyToken(token);

[NoCoverage] StringLiteral
src/lib/security/auth.guard.ts:20:58
 
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const request = context.switchToHttp().getRequest();
-    const token = request.headers.authorization?.replace('Bearer ', '');
+    const token = request.headers.authorization?.replace("", '');
     if (!token) throw new UnauthorizedException('No token provided');
     const payload = await this.authService.verifyToken(token);

[NoCoverage] ConditionalExpression
src/lib/security/auth.guard.ts:21:9
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const request = context.switchToHttp().getRequest();
     const token = request.headers.authorization?.replace('Bearer ', '');
-    if (!token) throw new UnauthorizedException('No token provided');
+    if (false) throw new UnauthorizedException('No token provided');
     const payload = await this.authService.verifyToken(token);
     this.cls.set('user', {

[NoCoverage] BooleanLiteral
src/lib/security/auth.guard.ts:21:9
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const request = context.switchToHttp().getRequest();
     const token = request.headers.authorization?.replace('Bearer ', '');
-    if (!token) throw new UnauthorizedException('No token provided');
+    if (token) throw new UnauthorizedException('No token provided');
     const payload = await this.authService.verifyToken(token);
     this.cls.set('user', {

[NoCoverage] StringLiteral
src/lib/security/auth.guard.ts:23:18
     const token = request.headers.authorization?.replace('Bearer ', '');
     if (!token) throw new UnauthorizedException('No token provided');
     const payload = await this.authService.verifyToken(token);
-    this.cls.set('user', {
+    this.cls.set("", {
       id: payload.sub,
       email: payload.email,
