[Killed] BlockStatement
src/api/role/role.service.ts:25:45
     this.permissionRepo = prisma.permission;
   }
 
-  async findPerms(permissionIds?: string[]) {
-    if (permissionIds) {
-      if (!permissionIds.length) return { data: [] };
-      const perms = await this.permissionRepo.findMany({
-        where: { id: { in: permissionIds } },
-      });
-      if (permissionIds && perms.length !== permissionIds.length)
-        throw new NotFoundException('Some permissions not found');
-      return {
-        data: perms,
-      };
-    }
-    const perms = await this.permissionRepo.findMany();
-    return {
-      data: perms,
-    };
-  }
+  async findPerms(permissionIds?: string[]) {}
 
   async findRoles(params: FindRolesParams) {
killedBy: RoleService findPerms should return a list of permissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": [{"id": "perm-id-1", "name": "CREATE_USER"}]}
Received: undefined

[Killed] ConditionalExpression
src/api/role/role.service.ts:26:9
   }
 
   async findPerms(permissionIds?: string[]) {
-    if (permissionIds) {
+    if (false) {
       if (!permissionIds.length) return { data: [] };
       const perms = await this.permissionRepo.findMany({
killedBy: RoleService findPerms should throw NotFoundException if some permissions are not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"data": []}

[Killed] BlockStatement
src/api/role/role.service.ts:26:24
   }
 
   async findPerms(permissionIds?: string[]) {
-    if (permissionIds) {
-      if (!permissionIds.length) return { data: [] };
-      const perms = await this.permissionRepo.findMany({
-        where: { id: { in: permissionIds } },
-      });
-      if (permissionIds && perms.length !== permissionIds.length)
-        throw new NotFoundException('Some permissions not found');
-      return {
-        data: perms,
-      };
-    }
+    if (permissionIds) {}
     const perms = await this.permissionRepo.findMany();
     return {
killedBy: RoleService findPerms should throw NotFoundException if some permissions are not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"data": []}

[Killed] ConditionalExpression
src/api/role/role.service.ts:27:11
 
   async findPerms(permissionIds?: string[]) {
     if (permissionIds) {
-      if (!permissionIds.length) return { data: [] };
+      if (true) return { data: [] };
       const perms = await this.permissionRepo.findMany({
         where: { id: { in: permissionIds } },
killedBy: RoleService findPerms should throw NotFoundException if some permissions are not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"data": []}

[Killed] BooleanLiteral
src/api/role/role.service.ts:27:11
 
   async findPerms(permissionIds?: string[]) {
     if (permissionIds) {
-      if (!permissionIds.length) return { data: [] };
+      if (permissionIds.length) return { data: [] };
       const perms = await this.permissionRepo.findMany({
         where: { id: { in: permissionIds } },
killedBy: RoleService findPerms should throw NotFoundException if some permissions are not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"data": []}

[Killed] EqualityOperator
src/api/role/role.service.ts:31:28
       const perms = await this.permissionRepo.findMany({
         where: { id: { in: permissionIds } },
       });
-      if (permissionIds && perms.length !== permissionIds.length)
+      if (permissionIds && perms.length === permissionIds.length)
         throw new NotFoundException('Some permissions not found');
       return {
killedBy: RoleService findPerms should throw NotFoundException if some permissions are not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"data": []}

[Killed] ConditionalExpression
src/api/role/role.service.ts:31:11
       const perms = await this.permissionRepo.findMany({
         where: { id: { in: permissionIds } },
       });
-      if (permissionIds && perms.length !== permissionIds.length)
+      if (false)
         throw new NotFoundException('Some permissions not found');
       return {
killedBy: RoleService findPerms should throw NotFoundException if some permissions are not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"data": []}

[Survived] StringLiteral
src/api/role/role.service.ts:32:37
         where: { id: { in: permissionIds } },
       });
       if (permissionIds && perms.length !== permissionIds.length)
-        throw new NotFoundException('Some permissions not found');
+        throw new NotFoundException("");
       return {
         data: perms,

[NoCoverage] ObjectLiteral
src/api/role/role.service.ts:33:14
       });
       if (permissionIds && perms.length !== permissionIds.length)
         throw new NotFoundException('Some permissions not found');
-      return {
-        data: perms,
-      };
+      return {};
     }
     const perms = await this.permissionRepo.findMany();

[Killed] ObjectLiteral
src/api/role/role.service.ts:38:12
       };
     }
     const perms = await this.permissionRepo.findMany();
-    return {
-      data: perms,
-    };
+    return {};
   }
 
killedBy: RoleService findPerms should return a list of permissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "data": Array [
-     Object {

[Killed] BooleanLiteral
src/api/role/role.service.ts:47:17
     const { name, page, pageSize, orderBy, orderDirection } = params;
     const where = {
       name: { contains: name },
-      isPreset: true,
+      isPreset: false,
     };
     const [roles, total] = await Promise.all([
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -19,11 +19,11 @@
      "name": "asc",
    },

[Killed] ObjectLiteral
src/api/role/role.service.ts:52:18
     const [roles, total] = await Promise.all([
       this.roleRepo.findMany({
         where,
-        orderBy: {
-          [orderBy]: orderDirection,
-        },
+        orderBy: {},
         skip: (page - 1) * pageSize,
         take: pageSize,
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,13 +13,11 @@
            "name": "asc",
          },

[Killed] ObjectLiteral
src/api/role/role.service.ts:57:18
         },
         skip: (page - 1) * pageSize,
         take: pageSize,
-        include: {
-          permissions: {
-            include: {
-              permission: {
-                select: {
-                  name: true,
-                },
-              },
-            },
-            orderBy: {
-              permission: {
-                name: Prisma.SortOrder.asc,
-              },
-            },
-          },
-        },
+        include: {},
       }),
       this.roleRepo.count({ where }),
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,22 +1,7 @@
  Object {
-   "include": Object {

[Killed] ObjectLiteral
src/api/role/role.service.ts:58:24
         skip: (page - 1) * pageSize,
         take: pageSize,
         include: {
-          permissions: {
-            include: {
-              permission: {
-                select: {
-                  name: true,
-                },
-              },
-            },
-            orderBy: {
-              permission: {
-                name: Prisma.SortOrder.asc,
-              },
-            },
-          },
+          permissions: {},
         },
       }),
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,21 +1,8 @@
  Object {
    "include": Object {

[Killed] ObjectLiteral
src/api/role/role.service.ts:59:22
         take: pageSize,
         include: {
           permissions: {
-            include: {
-              permission: {
-                select: {
-                  name: true,
-                },
-              },
-            },
+            include: {},
             orderBy: {
               permission: {
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,15 +1,9 @@
  Object {
    "include": Object {

[Killed] ObjectLiteral
src/api/role/role.service.ts:61:25
           permissions: {
             include: {
               permission: {
-                select: {
-                  name: true,
-                },
+                select: {},
               },
             },
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,13 +1,11 @@
  Object {
    "include": Object {

[Killed] ObjectLiteral
src/api/role/role.service.ts:66:22
                 },
               },
             },
-            orderBy: {
-              permission: {
-                name: Prisma.SortOrder.asc,
-              },
-            },
+            orderBy: {},
           },
         },
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,15 +6,11 @@
            "select": Object {
              "name": true,

[Killed] ObjectLiteral
src/api/role/role.service.ts:67:27
               },
             },
             orderBy: {
-              permission: {
-                name: Prisma.SortOrder.asc,
-              },
+              permission: {},
             },
           },
killedBy: RoleService findRoles should return a list of roles with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -7,13 +7,11 @@
              "name": true,
            },

[Survived] ObjectLiteral
src/api/role/role.service.ts:74:27
           },
         },
       }),
-      this.roleRepo.count({ where }),
+      this.roleRepo.count({}),
     ]);
     return {

[Killed] BlockStatement
src/api/role/role.service.ts:82:30
     };
   }
 
-  async findRole(id: string) {
-    const role = await this.roleRepo.findUnique({
-      where: { id },
-      include: {
-        permissions: {
-          include: {
-            permission: {
-              select: {
-                name: true,
-              },
-            },
-          },
-          orderBy: {
-            permission: {
-              name: Prisma.SortOrder.asc,
-            },
-          },
-        },
-      },
-    });
-    if (!role) throw new NotFoundException('Role not found');
-    return role;
-  }
+  async findRole(id: string) {}
 
   async existsRole(name: string) {
killedBy: RoleService findRole should return a role by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2024-12-20T00:17:30.185Z, "id": "role-id-1", "isPreset": true, "name": "Admin", "permissions": [{"permission": {"name": "CREATE_USER"}, "permissionId": "perm-id-1"}], "updatedAt": 2024-12-20T00:17:30.185Z}
Received: undefined

[Killed] ConditionalExpression
src/api/role/role.service.ts:102:9
         },
       },
     });
-    if (!role) throw new NotFoundException('Role not found');
+    if (true) throw new NotFoundException('Role not found');
     return role;
   }
killedBy: RoleService findRole should return a role by ID
statusReason: NotFoundException: Role not found

[Killed] ConditionalExpression
src/api/role/role.service.ts:102:9
         },
       },
     });
-    if (!role) throw new NotFoundException('Role not found');
+    if (false) throw new NotFoundException('Role not found');
     return role;
   }
killedBy: RoleService findRole should throw NotFoundException if role is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Survived] BooleanLiteral
src/api/role/role.service.ts:108:32
 
   async existsRole(name: string) {
     const role = await this.roleRepo.findFirst({
-      where: { name, isPreset: true },
+      where: { name, isPreset: false },
     });
     if (role)

[Survived] ConditionalExpression
src/api/role/role.service.ts:110:9
     const role = await this.roleRepo.findFirst({
       where: { name, isPreset: true },
     });
-    if (role)
+    if (true)
       throw new BadRequestException(`Role with name ${name} already exists`);
   }

[Survived] StringLiteral
src/api/role/role.service.ts:111:37
       where: { name, isPreset: true },
     });
     if (role)
-      throw new BadRequestException(`Role with name ${name} already exists`);
+      throw new BadRequestException(``);
   }
 

[NoCoverage] ArrowFunction
src/api/role/role.service.ts:117:60
   async createRole(data: CreateRoleData) {
     const { name, permissionIds } = data;
     await this.existsRole(name);
-    const perms = await this.findPerms(permissionIds).then(({ data }) =>
-      data.map((permission) => ({
-        permissionId: permission.id,
-      })),
+    const perms = await this.findPerms(permissionIds).then(() => undefined,
     );
     const createdRole = await this.roleRepo.create({

[NoCoverage] ArrowFunction
src/api/role/role.service.ts:118:16
     const { name, permissionIds } = data;
     await this.existsRole(name);
     const perms = await this.findPerms(permissionIds).then(({ data }) =>
-      data.map((permission) => ({
-        permissionId: permission.id,
-      })),
+      data.map(() => undefined),
     );
     const createdRole = await this.roleRepo.create({

[NoCoverage] BooleanLiteral
src/api/role/role.service.ts:125:19
     const createdRole = await this.roleRepo.create({
       data: {
         name,
-        isPreset: true,
+        isPreset: false,
         permissions: {
           createMany: {

[NoCoverage] ObjectLiteral
src/api/role/role.service.ts:127:23
         name,
         isPreset: true,
         permissions: {
-          createMany: {
-            data: perms,
-          },
+          createMany: {},
         },
       },

[NoCoverage] LogicalOperator
src/api/role/role.service.ts:154:9
 
   async updateRole(id: string, data: UpdateRoleData) {
     const role = await this.findRole(id);
-    if (!data.name && !data.permissionIds) return role;
+    if (!data.name || !data.permissionIds) return role;
     const permIds = role.permissions.map((p) => p.permissionId);
     const { name = role.name, permissionIds = permIds } = data;

[NoCoverage] ConditionalExpression
src/api/role/role.service.ts:154:9
 
   async updateRole(id: string, data: UpdateRoleData) {
     const role = await this.findRole(id);
-    if (!data.name && !data.permissionIds) return role;
+    if (true) return role;
     const permIds = role.permissions.map((p) => p.permissionId);
     const { name = role.name, permissionIds = permIds } = data;

[NoCoverage] ArrowFunction
src/api/role/role.service.ts:155:42
   async updateRole(id: string, data: UpdateRoleData) {
     const role = await this.findRole(id);
     if (!data.name && !data.permissionIds) return role;
-    const permIds = role.permissions.map((p) => p.permissionId);
+    const permIds = role.permissions.map(() => undefined);
     const { name = role.name, permissionIds = permIds } = data;
     if (name !== role.name) await this.existsRole(name);

[NoCoverage] ConditionalExpression
src/api/role/role.service.ts:157:9
     if (!data.name && !data.permissionIds) return role;
     const permIds = role.permissions.map((p) => p.permissionId);
     const { name = role.name, permissionIds = permIds } = data;
-    if (name !== role.name) await this.existsRole(name);
+    if (false) await this.existsRole(name);
     const perms = await this.findPerms(
       permissionIds.filter((id) => !permIds.includes(id)),

[NoCoverage] ConditionalExpression
src/api/role/role.service.ts:157:9
     if (!data.name && !data.permissionIds) return role;
     const permIds = role.permissions.map((p) => p.permissionId);
     const { name = role.name, permissionIds = permIds } = data;
-    if (name !== role.name) await this.existsRole(name);
+    if (true) await this.existsRole(name);
     const perms = await this.findPerms(
       permissionIds.filter((id) => !permIds.includes(id)),

[NoCoverage] MethodExpression
src/api/role/role.service.ts:159:7
     const { name = role.name, permissionIds = permIds } = data;
     if (name !== role.name) await this.existsRole(name);
     const perms = await this.findPerms(
-      permissionIds.filter((id) => !permIds.includes(id)),
+      permissionIds,
     ).then(({ data }) => data.map(({ id }) => ({ permissionId: id })));
     const updatedRole = await this.roleRepo.update({

[NoCoverage] BooleanLiteral
src/api/role/role.service.ts:159:36
     const { name = role.name, permissionIds = permIds } = data;
     if (name !== role.name) await this.existsRole(name);
     const perms = await this.findPerms(
-      permissionIds.filter((id) => !permIds.includes(id)),
+      permissionIds.filter((id) => permIds.includes(id)),
     ).then(({ data }) => data.map(({ id }) => ({ permissionId: id })));
     const updatedRole = await this.roleRepo.update({

[NoCoverage] ArrowFunction
src/api/role/role.service.ts:160:12
     if (name !== role.name) await this.existsRole(name);
     const perms = await this.findPerms(
       permissionIds.filter((id) => !permIds.includes(id)),
-    ).then(({ data }) => data.map(({ id }) => ({ permissionId: id })));
+    ).then(() => undefined);
     const updatedRole = await this.roleRepo.update({
       where: { id },

[NoCoverage] ArrowFunction
src/api/role/role.service.ts:160:35
     if (name !== role.name) await this.existsRole(name);
     const perms = await this.findPerms(
       permissionIds.filter((id) => !permIds.includes(id)),
-    ).then(({ data }) => data.map(({ id }) => ({ permissionId: id })));
+    ).then(({ data }) => data.map(() => undefined));
     const updatedRole = await this.roleRepo.update({
       where: { id },

[NoCoverage] LogicalOperator
src/api/role/role.service.ts:164:15
     const updatedRole = await this.roleRepo.update({
       where: { id },
       data: {
-        name: name ?? role.name,
+        name: name && role.name,
         permissions: {
           createMany: {

[NoCoverage] ObjectLiteral
src/api/role/role.service.ts:169:23
           createMany: {
             data: perms,
           },
-          deleteMany: {
-            roleId: id,
-            permissionId: {
-              notIn: permissionIds,
-            },
-          },
+          deleteMany: {},
         },
       },

[NoCoverage] ObjectLiteral
src/api/role/role.service.ts:177:16
           },
         },
       },
-      include: {
-        permissions: {
-          include: {
-            permission: {
-              select: {
-                name: true,
-              },
-            },
-          },
-          orderBy: {
-            permission: {
-              name: Prisma.SortOrder.asc,
-            },
-          },
-        },
-      },
+      include: {},
     });
     return updatedRole;

[NoCoverage] BlockStatement
src/api/role/role.service.ts:197:45
     return updatedRole;
   }
 
-  async forkRole(id: string, name?: string) {
-    const role = await this.findRole(id);
-    const connectPerms = role.permissions.map(({ permissionId }) => ({
-      permissionId_roleId: {
-        permissionId,
-        roleId: id,
-      },
-    }));
-
-    const forkedRole = await this.roleRepo.create({
-      data: {
-        name: name ?? role.name,
-        isPreset: false,
-        permissions: {
-          connect: connectPerms,
-        },
-      },
-      include: {
-        permissions: true,
-      },
-    });
-    return forkedRole;
-  }
+  async forkRole(id: string, name?: string) {}
 
   async deleteRole(id: string, isPreset = true) {

[NoCoverage] ArrowFunction
src/api/role/role.service.ts:199:47
 
   async forkRole(id: string, name?: string) {
     const role = await this.findRole(id);
-    const connectPerms = role.permissions.map(({ permissionId }) => ({
-      permissionId_roleId: {
-        permissionId,
-        roleId: id,
-      },
-    }));
+    const connectPerms = role.permissions.map(() => undefined);
 
     const forkedRole = await this.roleRepo.create({

[NoCoverage] ObjectLiteral
src/api/role/role.service.ts:199:70
 
   async forkRole(id: string, name?: string) {
     const role = await this.findRole(id);
-    const connectPerms = role.permissions.map(({ permissionId }) => ({
-      permissionId_roleId: {
-        permissionId,
-        roleId: id,
-      },
-    }));
+    const connectPerms = role.permissions.map(({ permissionId }) => ({}));
 
     const forkedRole = await this.roleRepo.create({

[NoCoverage] ObjectLiteral
src/api/role/role.service.ts:200:28
   async forkRole(id: string, name?: string) {
     const role = await this.findRole(id);
     const connectPerms = role.permissions.map(({ permissionId }) => ({
-      permissionId_roleId: {
-        permissionId,
-        roleId: id,
-      },
+      permissionId_roleId: {},
     }));
 

[NoCoverage] BooleanLiteral
src/api/role/role.service.ts:209:19
     const forkedRole = await this.roleRepo.create({
       data: {
         name: name ?? role.name,
-        isPreset: false,
+        isPreset: true,
         permissions: {
           connect: connectPerms,

[NoCoverage] BooleanLiteral
src/api/role/role.service.ts:215:22
         },
       },
       include: {
-        permissions: true,
+        permissions: false,
       },
     });

[Killed] BlockStatement
src/api/role/role.service.ts:221:49
     return forkedRole;
   }
 
-  async deleteRole(id: string, isPreset = true) {
-    try {
-      await this.roleRepo.delete({
-        where: {
-          id,
-          isPreset,
-        },
-      });
-
-      return {
-        message: 'Role deleted successfully',
-      };
-    } catch {
-      throw new NotFoundException('Role not found');
-    }
-  }
+  async deleteRole(id: string, isPreset = true) {}
 
   async findSuperuserRole() {
killedBy: RoleService deleteRole should delete a role
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Role deleted successfully"}
Received: undefined

[Killed] BooleanLiteral
src/api/role/role.service.ts:221:43
     return forkedRole;
   }
 
-  async deleteRole(id: string, isPreset = true) {
+  async deleteRole(id: string, isPreset = false) {
     try {
       await this.roleRepo.delete({
killedBy: RoleService deleteRole should delete a role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
      "id": "role-id-1",

[Killed] BlockStatement
src/api/role/role.service.ts:222:9
   }
 
   async deleteRole(id: string, isPreset = true) {
-    try {
-      await this.roleRepo.delete({
-        where: {
-          id,
-          isPreset,
-        },
-      });
-
-      return {
-        message: 'Role deleted successfully',
-      };
-    } catch {
+    try {} catch {
       throw new NotFoundException('Role not found');
     }
killedBy: RoleService deleteRole should delete a role
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Role deleted successfully"}
Received: undefined

[Killed] ObjectLiteral
src/api/role/role.service.ts:223:34
 
   async deleteRole(id: string, isPreset = true) {
     try {
-      await this.roleRepo.delete({
-        where: {
-          id,
-          isPreset,
-        },
-      });
+      await this.roleRepo.delete({});
 
       return {
killedBy: RoleService deleteRole should delete a role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "role-id-1",

[Killed] ObjectLiteral
src/api/role/role.service.ts:224:16
   async deleteRole(id: string, isPreset = true) {
     try {
       await this.roleRepo.delete({
-        where: {
-          id,
-          isPreset,
-        },
+        where: {},
       });
 
killedBy: RoleService deleteRole should delete a role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": "role-id-1",

[Killed] ObjectLiteral
src/api/role/role.service.ts:230:14
         },
       });
 
-      return {
-        message: 'Role deleted successfully',
-      };
+      return {};
     } catch {
       throw new NotFoundException('Role not found');
killedBy: RoleService deleteRole should delete a role
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "message": "Role deleted successfully",
- }

[Killed] BlockStatement
src/api/role/role.service.ts:233:13
       return {
         message: 'Role deleted successfully',
       };
-    } catch {
-      throw new NotFoundException('Role not found');
-    }
+    } catch {}
   }
 
killedBy: RoleService deleteRole should throw NotFoundException if role does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/api/role/role.service.ts:238:29
     }
   }
 
-  async findSuperuserRole() {
-    const role = await this.roleRepo.findFirst({
-      where: { name: 'Superuser', isPreset: true },
-    });
-    if (!role)
-      throw new InternalServerErrorException('Superuser role not found');
-    return role;
-  }
+  async findSuperuserRole() {}
 }
 
killedBy: RoleService findSuperuserRole should return the superuser role
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2024-12-20T00:18:20.777Z, "id": "role-id-1", "isPreset": true, "name": "Admin", "permissions": [{"permission": {"name": "CREATE_USER"}, "permissionId": "perm-id-1"}], "updatedAt": 2024-12-20T00:18:20.777Z}
Received: undefined

[Killed] BooleanLiteral
src/api/role/role.service.ts:240:45
 
   async findSuperuserRole() {
     const role = await this.roleRepo.findFirst({
-      where: { name: 'Superuser', isPreset: true },
+      where: { name: 'Superuser', isPreset: false },
     });
     if (!role)
killedBy: RoleService findSuperuserRole should return the superuser role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "isPreset": true,

[Killed] StringLiteral
src/api/role/role.service.ts:240:22
 
   async findSuperuserRole() {
     const role = await this.roleRepo.findFirst({
-      where: { name: 'Superuser', isPreset: true },
+      where: { name: "", isPreset: true },
     });
     if (!role)
killedBy: RoleService findSuperuserRole should return the superuser role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
      "isPreset": true,

[Killed] ConditionalExpression
src/api/role/role.service.ts:242:9
     const role = await this.roleRepo.findFirst({
       where: { name: 'Superuser', isPreset: true },
     });
-    if (!role)
+    if (true)
       throw new InternalServerErrorException('Superuser role not found');
     return role;
killedBy: RoleService findSuperuserRole should return the superuser role
statusReason: InternalServerErrorException: Superuser role not found

[Killed] BooleanLiteral
src/api/role/role.service.ts:242:9
     const role = await this.roleRepo.findFirst({
       where: { name: 'Superuser', isPreset: true },
     });
-    if (!role)
+    if (role)
       throw new InternalServerErrorException('Superuser role not found');
     return role;
killedBy: RoleService findSuperuserRole should return the superuser role
statusReason: InternalServerErrorException: Superuser role not found
