[NoCoverage] BlockStatement
src/lib/security/permission.guard.ts:20:66
     private readonly authService: AuthService,
     private readonly cls: ClsService<AppContext>,
   ) {}
-  async canActivate(context: ExecutionContext): Promise<boolean> {
-    const permissions = this.reflector.get<Permissions[]>(
-      'permissions',
-      context.getHandler(),
-    );
-    const userId = this.cls.get('user.id');
-    const hasPermission = await this.authService.verifyPermissions(
-      userId,
-      permissions,
-    );
-    if (!hasPermission) throw new ForbiddenException();
-    return true;
-  }
+  async canActivate(context: ExecutionContext): Promise<boolean> {}
 }
 

[NoCoverage] StringLiteral
src/lib/security/permission.guard.ts:22:7
   ) {}
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const permissions = this.reflector.get<Permissions[]>(
-      'permissions',
+      "",
       context.getHandler(),
     );

[NoCoverage] ConditionalExpression
src/lib/security/permission.guard.ts:30:9
       userId,
       permissions,
     );
-    if (!hasPermission) throw new ForbiddenException();
+    if (false) throw new ForbiddenException();
     return true;
   }

[NoCoverage] ConditionalExpression
src/lib/security/permission.guard.ts:30:9
       userId,
       permissions,
     );
-    if (!hasPermission) throw new ForbiddenException();
+    if (true) throw new ForbiddenException();
     return true;
   }

[NoCoverage] BooleanLiteral
src/lib/security/permission.guard.ts:31:12
       permissions,
     );
     if (!hasPermission) throw new ForbiddenException();
-    return true;
+    return false;
   }
 }
