[NoCoverage] BlockStatement
src/api/tasks/task.controller.ts:39:56
   @Get()
   @ApiOperation({ summary: 'Find list of tasks' })
   @ApiOkResponse({ type: TaskListDto })
-  async findTasks(@Query() params: FindTasksParamsDto) {
-    return await this.taskService.findTasks(params);
-  }
+  async findTasks(@Query() params: FindTasksParamsDto) {}
 
   @UserAction(Action.FIND_TASK)

[NoCoverage] BlockStatement
src/api/tasks/task.controller.ts:52:43
     status: 404,
     description: 'Task not found',
   })
-  async findTask(@Param('id') id: string) {
-    return await this.taskService.findTask(id);
-  }
+  async findTask(@Param('id') id: string) {}
 
   @UserAction(Action.CREATE_TASK)

[NoCoverage] BlockStatement
src/api/tasks/task.controller.ts:72:53
     status: 409,
     description: 'Assignee or reporter not found',
   })
-  async createTask(@Body() data: CreateTaskDataDto) {
-    return await this.taskService.createTask(data);
-  }
+  async createTask(@Body() data: CreateTaskDataDto) {}
 
   @UserAction(Action.UPDATE_TASK)

[NoCoverage] BlockStatement
src/api/tasks/task.controller.ts:95:78
     status: 409,
     description: 'Assignee or reporter not found',
   })
-  async updateTask(@Param('id') id: string, @Body() data: UpdateTaskDataDto) {
-    return await this.taskService.updateTask(id, data);
-  }
+  async updateTask(@Param('id') id: string, @Body() data: UpdateTaskDataDto) {}
 
   @UserAction(Action.DELETE_TASK)

[NoCoverage] BlockStatement
src/api/tasks/task.controller.ts:116:45
     status: 404,
     description: 'Task not found',
   })
-  async deleteTask(@Param('id') id: string) {
-    return await this.taskService.deleteTask(id);
-  }
+  async deleteTask(@Param('id') id: string) {}
 }
 
