[Survived] BlockStatement
src/lib/utils/crypto.ts:6:55
 const SCRYPT_PARAMS = { N: 32768, r: 8, p: 1, maxmem: 64 * 1024 * 1024 };
 const SCRYPT_PREFIX = '$scrypt$N=32768,r=8,p=1,maxmem=67108864$';
 
-const serializeHash = (hash: Buffer, salt: Buffer) => {
-  const saltString = salt.toString('base64').split('=')[0];
-  const hashString = hash.toString('base64').split('=')[0];
-  return `${SCRYPT_PREFIX}${saltString}$${hashString}`;
-};
+const serializeHash = (hash: Buffer, salt: Buffer) => {};
 
 const parseOptions = (options: string) => {

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:12:43
   return `${SCRYPT_PREFIX}${saltString}$${hashString}`;
 };
 
-const parseOptions = (options: string) => {
-  const values = [];
-  const items = options.split(',');
-  for (const item of items) {
-    const [key, val] = item.split('=');
-    values.push([key, Number(val)]);
-  }
-  return Object.fromEntries(values);
-};
+const parseOptions = (options: string) => {};
 
 const deserializeHash = (phcString: string) => {

[NoCoverage] ArrayDeclaration
src/lib/utils/crypto.ts:13:18
 };
 
 const parseOptions = (options: string) => {
-  const values = [];
+  const values = ["Stryker was here"];
   const items = options.split(',');
   for (const item of items) {

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:15:29
 const parseOptions = (options: string) => {
   const values = [];
   const items = options.split(',');
-  for (const item of items) {
-    const [key, val] = item.split('=');
-    values.push([key, Number(val)]);
-  }
+  for (const item of items) {}
   return Object.fromEntries(values);
 };

[NoCoverage] ArrayDeclaration
src/lib/utils/crypto.ts:17:17
   const items = options.split(',');
   for (const item of items) {
     const [key, val] = item.split('=');
-    values.push([key, Number(val)]);
+    values.push([]);
   }
   return Object.fromEntries(values);

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:22:48
   return Object.fromEntries(values);
 };
 
-const deserializeHash = (phcString: string) => {
-  const [, name, options, salt64, hash64] = phcString.split('$');
-  if (name !== 'scrypt') {
-    throw new Error('Node.js crypto module only supports scrypt');
-  }
-  const params = parseOptions(options);
-  const salt = Buffer.from(salt64, 'base64');
-  const hash = Buffer.from(hash64, 'base64');
-  return { params, salt, hash };
-};
+const deserializeHash = (phcString: string) => {};
 
 const SALT_LEN = 32;

[NoCoverage] ConditionalExpression
src/lib/utils/crypto.ts:24:7
 
 const deserializeHash = (phcString: string) => {
   const [, name, options, salt64, hash64] = phcString.split('$');
-  if (name !== 'scrypt') {
+  if (true) {
     throw new Error('Node.js crypto module only supports scrypt');
   }

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:24:26
 
 const deserializeHash = (phcString: string) => {
   const [, name, options, salt64, hash64] = phcString.split('$');
-  if (name !== 'scrypt') {
-    throw new Error('Node.js crypto module only supports scrypt');
-  }
+  if (name !== 'scrypt') {}
   const params = parseOptions(options);
   const salt = Buffer.from(salt64, 'base64');

[NoCoverage] ObjectLiteral
src/lib/utils/crypto.ts:30:10
   const params = parseOptions(options);
   const salt = Buffer.from(salt64, 'base64');
   const hash = Buffer.from(hash64, 'base64');
-  return { params, salt, hash };
+  return {};
 };
 

[Killed] BlockStatement
src/lib/utils/crypto.ts:37:36
 const KEY_LEN = 64;
 
 export const hashPassword = (password: string): Promise<string> =>
-  new Promise((resolve, reject) => {
-    crypto.randomBytes(SALT_LEN, (err, salt) => {
-      if (err) {
-        reject(err);
-        return;
-      }
-      crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {
-        if (err) {
-          reject(err);
-          return;
-        }
-        resolve(serializeHash(hash, salt));
-      });
-    });
-  });
+  new Promise((resolve, reject) => {});
 
 export const validatePassword = (
killedBy: UserService createUser should create a user
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/lib/utils/crypto.ts:38:49
 
 export const hashPassword = (password: string): Promise<string> =>
   new Promise((resolve, reject) => {
-    crypto.randomBytes(SALT_LEN, (err, salt) => {
-      if (err) {
-        reject(err);
-        return;
-      }
-      crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {
-        if (err) {
-          reject(err);
-          return;
-        }
-        resolve(serializeHash(hash, salt));
-      });
-    });
+    crypto.randomBytes(SALT_LEN, (err, salt) => {});
   });
 
killedBy: UserService createUser should create a user
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/lib/utils/crypto.ts:39:11
 export const hashPassword = (password: string): Promise<string> =>
   new Promise((resolve, reject) => {
     crypto.randomBytes(SALT_LEN, (err, salt) => {
-      if (err) {
+      if (true) {
         reject(err);
         return;
killedBy: UserService createUser should create a user
statusReason: Error: thrown: null

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:39:16
 export const hashPassword = (password: string): Promise<string> =>
   new Promise((resolve, reject) => {
     crypto.randomBytes(SALT_LEN, (err, salt) => {
-      if (err) {
-        reject(err);
-        return;
-      }
+      if (err) {}
       crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {
         if (err) {

[Killed] BlockStatement
src/lib/utils/crypto.ts:43:76
         reject(err);
         return;
       }
-      crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {
-        if (err) {
-          reject(err);
-          return;
-        }
-        resolve(serializeHash(hash, salt));
-      });
+      crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {});
     });
   });
killedBy: UserService createUser should create a user
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/lib/utils/crypto.ts:44:13
         return;
       }
       crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {
-        if (err) {
+        if (true) {
           reject(err);
           return;
killedBy: UserService createUser should create a user
statusReason: Error: thrown: null

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:44:18
         return;
       }
       crypto.scrypt(password, salt, KEY_LEN, SCRYPT_PARAMS, (err, hash) => {
-        if (err) {
-          reject(err);
-          return;
-        }
+        if (err) {}
         resolve(serializeHash(hash, salt));
       });

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:56:24
 export const validatePassword = (
   password: string,
   serHash: string,
-): Promise<boolean> => {
-  const { params, salt, hash } = deserializeHash(serHash);
-  return new Promise((resolve, reject) => {
-    const callback = (err: Error, hashedPassword: Buffer) => {
-      if (err) {
-        reject(err);
-        return;
-      }
-      resolve(crypto.timingSafeEqual(hashedPassword, hash));
-    };
-    crypto.scrypt(password, salt, hash.length, params, callback);
-  });
-};
+): Promise<boolean> => {};
 

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:58:43
   serHash: string,
 ): Promise<boolean> => {
   const { params, salt, hash } = deserializeHash(serHash);
-  return new Promise((resolve, reject) => {
-    const callback = (err: Error, hashedPassword: Buffer) => {
-      if (err) {
-        reject(err);
-        return;
-      }
-      resolve(crypto.timingSafeEqual(hashedPassword, hash));
-    };
-    crypto.scrypt(password, salt, hash.length, params, callback);
-  });
+  return new Promise((resolve, reject) => {});
 };
 

[NoCoverage] BlockStatement
src/lib/utils/crypto.ts:59:62
 ): Promise<boolean> => {
   const { params, salt, hash } = deserializeHash(serHash);
   return new Promise((resolve, reject) => {
-    const callback = (err: Error, hashedPassword: Buffer) => {
-      if (err) {
-        reject(err);
-        return;
-      }
-      resolve(crypto.timingSafeEqual(hashedPassword, hash));
-    };
+    const callback = (err: Error, hashedPassword: Buffer) => {};
     crypto.scrypt(password, salt, hash.length, params, callback);
   });

[NoCoverage] ConditionalExpression
src/lib/utils/crypto.ts:60:11
   const { params, salt, hash } = deserializeHash(serHash);
   return new Promise((resolve, reject) => {
     const callback = (err: Error, hashedPassword: Buffer) => {
-      if (err) {
+      if (true) {
         reject(err);
         return;

[NoCoverage] ConditionalExpression
src/lib/utils/crypto.ts:60:11
   const { params, salt, hash } = deserializeHash(serHash);
   return new Promise((resolve, reject) => {
     const callback = (err: Error, hashedPassword: Buffer) => {
-      if (err) {
+      if (false) {
         reject(err);
         return;
