[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:25:38
 
   private readonly taskRepo: Prisma.TaskDelegate;
 
-  constructor(prisma: PrismaService) {
-    this.taskRepo = prisma.task;
-  }
+  constructor(prisma: PrismaService) {}
 
   async findTasks(params: FindTasksParams) {

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:51:11
     } = params;
     const where: Prisma.TaskWhereInput = {
       ...(searchTerm
-        ? {
-            OR: [
-              { title: { contains: searchTerm } },
-              { description: { contains: searchTerm } },
-            ],
-          }
+        ? {}
         : {}),
       code: { startsWith: code },

[NoCoverage] ArrayDeclaration
src/api/tasks/task.service.ts:52:17
     const where: Prisma.TaskWhereInput = {
       ...(searchTerm
         ? {
-            OR: [
-              { title: { contains: searchTerm } },
-              { description: { contains: searchTerm } },
-            ],
+            OR: [],
           }
         : {}),

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:54:15
         ? {
             OR: [
               { title: { contains: searchTerm } },
-              { description: { contains: searchTerm } },
+              {},
             ],
           }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:54:30
         ? {
             OR: [
               { title: { contains: searchTerm } },
-              { description: { contains: searchTerm } },
+              { description: {} },
             ],
           }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:66:16
         gte: createdAtFrom,
         lte: createdAtTo,
       },
-      dueDate: {
-        gte: dueDateFrom,
-        lte: dueDateTo,
-      },
+      dueDate: {},
       startDate: {
         gte: startDateFrom,

[NoCoverage] ArithmeticOperator
src/api/tasks/task.service.ts:81:16
       this.taskRepo.findMany({
         where,
         take: pageSize,
-        skip: (page - 1) * pageSize,
+        skip: (page + 1) * pageSize,
         orderBy: {
           [orderBy]: orderDirection,

[NoCoverage] ArithmeticOperator
src/api/tasks/task.service.ts:81:15
       this.taskRepo.findMany({
         where,
         take: pageSize,
-        skip: (page - 1) * pageSize,
+        skip: (page - 1) / pageSize,
         orderBy: {
           [orderBy]: orderDirection,

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:85:18
         orderBy: {
           [orderBy]: orderDirection,
         },
-        include: {
-          assignee: {
-            select: {
-              id: true,
-              firstName: true,
-              lastName: true,
-            },
-          },
-          reporter: {
-            select: {
-              id: true,
-              firstName: true,
-              lastName: true,
-            },
-          },
-        },
+        include: {},
       }),
       this.taskRepo.count({ where }),

[NoCoverage] BooleanLiteral
src/api/tasks/task.service.ts:89:26
           assignee: {
             select: {
               id: true,
-              firstName: true,
+              firstName: false,
               lastName: true,
             },

[NoCoverage] BooleanLiteral
src/api/tasks/task.service.ts:90:25
             select: {
               id: true,
               firstName: true,
-              lastName: true,
+              lastName: false,
             },
           },

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:94:21
             },
           },
           reporter: {
-            select: {
-              id: true,
-              firstName: true,
-              lastName: true,
-            },
+            select: {},
           },
         },

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:104:12
       }),
       this.taskRepo.count({ where }),
     ]);
-    return {
-      data: data.map(({ description, spent, ...task }) => task),
-      total,
-    };
+    return {};
   }
 

[NoCoverage] ArrowFunction
src/api/tasks/task.service.ts:105:22
       this.taskRepo.count({ where }),
     ]);
     return {
-      data: data.map(({ description, spent, ...task }) => task),
+      data: data.map(() => undefined),
       total,
     };

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:110:30
     };
   }
 
-  async findTask(id: string) {
-    const task = await this.taskRepo.findUnique({
-      where: { id },
-      include: {
-        assignee: {
-          select: {
-            id: true,
-            firstName: true,
-            lastName: true,
-          },
-        },
-        reporter: {
-          select: {
-            id: true,
-            firstName: true,
-            lastName: true,
-          },
-        },
-      },
-    });
-    if (!task) throw new NotFoundException('Task not found');
-    return task;
-  }
+  async findTask(id: string) {}
 
   async createTask(data: CreateTaskData) {

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:112:14
 
   async findTask(id: string) {
     const task = await this.taskRepo.findUnique({
-      where: { id },
+      where: {},
       include: {
         assignee: {

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:115:19
       where: { id },
       include: {
         assignee: {
-          select: {
-            id: true,
-            firstName: true,
-            lastName: true,
-          },
+          select: {},
         },
         reporter: {

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:130:9
         },
       },
     });
-    if (!task) throw new NotFoundException('Task not found');
+    if (true) throw new NotFoundException('Task not found');
     return task;
   }

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:130:9
         },
       },
     });
-    if (!task) throw new NotFoundException('Task not found');
+    if (false) throw new NotFoundException('Task not found');
     return task;
   }

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:137:7
   async createTask(data: CreateTaskData) {
     const { assigneeId, reporterId, ...payload } = data;
     if (
-      payload.dueDate &&
-      payload.startDate &&
-      payload.dueDate <= payload.startDate
+      true
     )
       throw new BadRequestException('Due date must be greater than start date');

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:137:7
   async createTask(data: CreateTaskData) {
     const { assigneeId, reporterId, ...payload } = data;
     if (
-      payload.dueDate &&
-      payload.startDate &&
+      true &&
       payload.dueDate <= payload.startDate
     )

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:139:7
     if (
       payload.dueDate &&
       payload.startDate &&
-      payload.dueDate <= payload.startDate
+      payload.dueDate > payload.startDate
     )
       throw new BadRequestException('Due date must be greater than start date');

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:139:7
     if (
       payload.dueDate &&
       payload.startDate &&
-      payload.dueDate <= payload.startDate
+      true
     )
       throw new BadRequestException('Due date must be greater than start date');

[NoCoverage] StringLiteral
src/api/tasks/task.service.ts:141:37
       payload.startDate &&
       payload.dueDate <= payload.startDate
     )
-      throw new BadRequestException('Due date must be greater than start date');
+      throw new BadRequestException("");
     const task = await this.taskRepo
       .create({

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:147:13
         data: {
           ...payload,
           isOverdue:
-            payload.dueDate <= new Date() &&
+            payload.dueDate < new Date() &&
             payload.status !== TaskStatus.DONE &&
             payload.status !== TaskStatus.CANCELED,

[NoCoverage] LogicalOperator
src/api/tasks/task.service.ts:147:13
         data: {
           ...payload,
           isOverdue:
-            payload.dueDate <= new Date() &&
-            payload.status !== TaskStatus.DONE &&
-            payload.status !== TaskStatus.CANCELED,
+            payload.dueDate <= new Date() && payload.status !== TaskStatus.DONE || payload.status !== TaskStatus.CANCELED,
           ...(assigneeId ? { assignee: { connect: { id: assigneeId } } } : {}),
           ...(reporterId ? { reporter: { connect: { id: reporterId } } } : {}),

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:148:13
           ...payload,
           isOverdue:
             payload.dueDate <= new Date() &&
-            payload.status !== TaskStatus.DONE &&
+            payload.status === TaskStatus.DONE &&
             payload.status !== TaskStatus.CANCELED,
           ...(assigneeId ? { assignee: { connect: { id: assigneeId } } } : {}),

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:148:13
           ...payload,
           isOverdue:
             payload.dueDate <= new Date() &&
-            payload.status !== TaskStatus.DONE &&
+            true &&
             payload.status !== TaskStatus.CANCELED,
           ...(assigneeId ? { assignee: { connect: { id: assigneeId } } } : {}),

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:149:13
           isOverdue:
             payload.dueDate <= new Date() &&
             payload.status !== TaskStatus.DONE &&
-            payload.status !== TaskStatus.CANCELED,
+            payload.status === TaskStatus.CANCELED,
           ...(assigneeId ? { assignee: { connect: { id: assigneeId } } } : {}),
           ...(reporterId ? { reporter: { connect: { id: reporterId } } } : {}),

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:149:13
           isOverdue:
             payload.dueDate <= new Date() &&
             payload.status !== TaskStatus.DONE &&
-            payload.status !== TaskStatus.CANCELED,
+            true,
           ...(assigneeId ? { assignee: { connect: { id: assigneeId } } } : {}),
           ...(reporterId ? { reporter: { connect: { id: reporterId } } } : {}),

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:151:40
             payload.status !== TaskStatus.DONE &&
             payload.status !== TaskStatus.CANCELED,
           ...(assigneeId ? { assignee: { connect: { id: assigneeId } } } : {}),
-          ...(reporterId ? { reporter: { connect: { id: reporterId } } } : {}),
+          ...(reporterId ? { reporter: {} } : {}),
         },
         include: {

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:170:56
           },
         },
       })
-      .catch((error: PrismaClientKnownRequestError) => {
-        // INFO: https://www.prisma.io/docs/orm/reference/error-reference#p2025
-        if (error.code === 'P2025')
-          throw new ConflictException('Assignee or reporter not found');
-        throw error;
-      });
+      .catch((error: PrismaClientKnownRequestError) => {});
     return task;
   }

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:172:13
       })
       .catch((error: PrismaClientKnownRequestError) => {
         // INFO: https://www.prisma.io/docs/orm/reference/error-reference#p2025
-        if (error.code === 'P2025')
+        if (false)
           throw new ConflictException('Assignee or reporter not found');
         throw error;

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:172:13
       })
       .catch((error: PrismaClientKnownRequestError) => {
         // INFO: https://www.prisma.io/docs/orm/reference/error-reference#p2025
-        if (error.code === 'P2025')
+        if (error.code !== 'P2025')
           throw new ConflictException('Assignee or reporter not found');
         throw error;

[NoCoverage] ArrowFunction
src/api/tasks/task.service.ts:181:47
 
   async updateTask(id: string, data: UpdateTaskData) {
     const { assigneeId, reporterId, ...payload } = data;
-    const task = await this.findTask(id).then((task) => ({
-      ...task,
-      ...payload,
-    }));
+    const task = await this.findTask(id).then(() => undefined);
     if (task.dueDate && task.startDate && task.dueDate <= task.startDate)
       throw new BadRequestException('Due date must be greater than start date');

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:181:58
 
   async updateTask(id: string, data: UpdateTaskData) {
     const { assigneeId, reporterId, ...payload } = data;
-    const task = await this.findTask(id).then((task) => ({
-      ...task,
-      ...payload,
-    }));
+    const task = await this.findTask(id).then((task) => ({}));
     if (task.dueDate && task.startDate && task.dueDate <= task.startDate)
       throw new BadRequestException('Due date must be greater than start date');

[NoCoverage] LogicalOperator
src/api/tasks/task.service.ts:185:9
       ...task,
       ...payload,
     }));
-    if (task.dueDate && task.startDate && task.dueDate <= task.startDate)
+    if (task.dueDate && task.startDate || task.dueDate <= task.startDate)
       throw new BadRequestException('Due date must be greater than start date');
     const updatedTask = await this.taskRepo

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:185:9
       ...task,
       ...payload,
     }));
-    if (task.dueDate && task.startDate && task.dueDate <= task.startDate)
+    if (true)
       throw new BadRequestException('Due date must be greater than start date');
     const updatedTask = await this.taskRepo

[NoCoverage] StringLiteral
src/api/tasks/task.service.ts:186:37
       ...payload,
     }));
     if (task.dueDate && task.startDate && task.dueDate <= task.startDate)
-      throw new BadRequestException('Due date must be greater than start date');
+      throw new BadRequestException("");
     const updatedTask = await this.taskRepo
       .update({

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:193:13
         data: {
           ...payload,
           isOverdue:
-            task.dueDate <= new Date() &&
-            task.status !== TaskStatus.DONE &&
-            task.status !== TaskStatus.CANCELED,
+            true,
           assignee: {
             ...(assigneeId === null

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:193:13
         data: {
           ...payload,
           isOverdue:
-            task.dueDate <= new Date() &&
-            task.status !== TaskStatus.DONE &&
+            true &&
             task.status !== TaskStatus.CANCELED,
           assignee: {

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:194:13
           ...payload,
           isOverdue:
             task.dueDate <= new Date() &&
-            task.status !== TaskStatus.DONE &&
+            true &&
             task.status !== TaskStatus.CANCELED,
           assignee: {

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:194:13
           ...payload,
           isOverdue:
             task.dueDate <= new Date() &&
-            task.status !== TaskStatus.DONE &&
+            task.status === TaskStatus.DONE &&
             task.status !== TaskStatus.CANCELED,
           assignee: {

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:195:13
           isOverdue:
             task.dueDate <= new Date() &&
             task.status !== TaskStatus.DONE &&
-            task.status !== TaskStatus.CANCELED,
+            true,
           assignee: {
             ...(assigneeId === null

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:195:13
           isOverdue:
             task.dueDate <= new Date() &&
             task.status !== TaskStatus.DONE &&
-            task.status !== TaskStatus.CANCELED,
+            task.status === TaskStatus.CANCELED,
           assignee: {
             ...(assigneeId === null

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:197:17
             task.status !== TaskStatus.DONE &&
             task.status !== TaskStatus.CANCELED,
           assignee: {
-            ...(assigneeId === null
+            ...(false
               ? { disconnect: true }
               : assigneeId

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:197:17
             task.status !== TaskStatus.DONE &&
             task.status !== TaskStatus.CANCELED,
           assignee: {
-            ...(assigneeId === null
+            ...(assigneeId !== null
               ? { disconnect: true }
               : assigneeId

[NoCoverage] BooleanLiteral
src/api/tasks/task.service.ts:198:31
             task.status !== TaskStatus.CANCELED,
           assignee: {
             ...(assigneeId === null
-              ? { disconnect: true }
+              ? { disconnect: false }
               : assigneeId
                 ? { connect: { id: assigneeId } }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:198:17
             task.status !== TaskStatus.CANCELED,
           assignee: {
             ...(assigneeId === null
-              ? { disconnect: true }
+              ? {}
               : assigneeId
                 ? { connect: { id: assigneeId } }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:200:19
             ...(assigneeId === null
               ? { disconnect: true }
               : assigneeId
-                ? { connect: { id: assigneeId } }
+                ? {}
                 : {}),
           },

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:203:21
                 ? { connect: { id: assigneeId } }
                 : {}),
           },
-          reporter: {
-            ...(reporterId === null
-              ? { disconnect: true }
-              : reporterId
-                ? { connect: { id: reporterId } }
-                : {}),
-          },
+          reporter: {},
         },
         include: {

[NoCoverage] EqualityOperator
src/api/tasks/task.service.ts:204:17
                 : {}),
           },
           reporter: {
-            ...(reporterId === null
+            ...(reporterId !== null
               ? { disconnect: true }
               : reporterId

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:204:17
                 : {}),
           },
           reporter: {
-            ...(reporterId === null
+            ...(true
               ? { disconnect: true }
               : reporterId

[NoCoverage] BooleanLiteral
src/api/tasks/task.service.ts:205:31
           },
           reporter: {
             ...(reporterId === null
-              ? { disconnect: true }
+              ? { disconnect: false }
               : reporterId
                 ? { connect: { id: reporterId } }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:205:17
           },
           reporter: {
             ...(reporterId === null
-              ? { disconnect: true }
+              ? {}
               : reporterId
                 ? { connect: { id: reporterId } }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:207:30
             ...(reporterId === null
               ? { disconnect: true }
               : reporterId
-                ? { connect: { id: reporterId } }
+                ? { connect: {} }
                 : {}),
           },

[NoCoverage] ConditionalExpression
src/api/tasks/task.service.ts:230:13
       })
       .catch((error: PrismaClientKnownRequestError) => {
         // INFO: https://www.prisma.io/docs/orm/reference/error-reference#p2025
-        if (error.code === 'P2025')
+        if (true)
           throw new ConflictException('Assignee or reporter not found');
         throw error;

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:237:32
     return updatedTask;
   }
 
-  async deleteTask(id: string) {
-    try {
-      await this.taskRepo.delete({
-        where: {
-          id,
-        },
-      });
-      return {
-        message: 'Task deleted successfully',
-      };
-    } catch {
-      throw new NotFoundException('Task not found');
-    }
-  }
+  async deleteTask(id: string) {}
 
   @Cron('*/5 * * * *')

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:238:9
   }
 
   async deleteTask(id: string) {
-    try {
-      await this.taskRepo.delete({
-        where: {
-          id,
-        },
-      });
-      return {
-        message: 'Task deleted successfully',
-      };
-    } catch {
+    try {} catch {
       throw new NotFoundException('Task not found');
     }

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:239:34
 
   async deleteTask(id: string) {
     try {
-      await this.taskRepo.delete({
-        where: {
-          id,
-        },
-      });
+      await this.taskRepo.delete({});
       return {
         message: 'Task deleted successfully',

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:247:13
       return {
         message: 'Task deleted successfully',
       };
-    } catch {
-      throw new NotFoundException('Task not found');
-    }
+    } catch {}
   }
 

[NoCoverage] StringLiteral
src/api/tasks/task.service.ts:248:35
         message: 'Task deleted successfully',
       };
     } catch {
-      throw new NotFoundException('Task not found');
+      throw new NotFoundException("");
     }
   }

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:253:30
   }
 
   @Cron('*/5 * * * *')
-  async updateOverdueTasks() {
-    this.logger.log('Updating overdue tasks');
-
-    await this.taskRepo.updateMany({
-      where: {
-        dueDate: {
-          lte: new Date(),
-        },
-        status: {
-          notIn: [TaskStatus.DONE, TaskStatus.CANCELED],
-        },
-      },
-      data: {
-        isOverdue: true,
-      },
-    });
-  }
+  async updateOverdueTasks() {}
 
   async onModuleInit() {

[NoCoverage] ObjectLiteral
src/api/tasks/task.service.ts:257:14
     this.logger.log('Updating overdue tasks');
 
     await this.taskRepo.updateMany({
-      where: {
-        dueDate: {
-          lte: new Date(),
-        },
-        status: {
-          notIn: [TaskStatus.DONE, TaskStatus.CANCELED],
-        },
-      },
+      where: {},
       data: {
         isOverdue: true,

[NoCoverage] BooleanLiteral
src/api/tasks/task.service.ts:266:20
         },
       },
       data: {
-        isOverdue: true,
+        isOverdue: false,
       },
     });

[NoCoverage] BlockStatement
src/api/tasks/task.service.ts:271:24
     });
   }
 
-  async onModuleInit() {
-    await this.updateOverdueTasks();
-  }
+  async onModuleInit() {}
 }
 
