[Killed] BlockStatement
src/api/auth/auth.controller.ts:46:66
     status: 401,
     description: 'Invalid credentials',
   })
-  async login(@Body() data: LogInDTO, @Res() response: Response) {
-    const tokens = await this.authService.login(data);
-    CookieUtils.setRefreshToken(response, tokens.refreshToken);
-    response.json({ token: tokens.accessToken });
-  }
+  async login(@Body() data: LogInDTO, @Res() response: Response) {}
 
   @Post('/refresh')
killedBy: AuthController login should log in a user and set refresh token in cookies
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@example.com", "password": "password"}

Number of calls: 0

[Killed] BlockStatement
src/api/auth/auth.controller.ts:63:74
     status: 400,
     description: 'Invalid token',
   })
-  async refreshToken(@Req() request: Request, @Res() response: Response) {
-    const token = CookieUtils.getRefreshToken(request);
-    const tokens = await this.authService.refreshTokens(token);
-    CookieUtils.setRefreshToken(response, tokens.refreshToken);
-    response.json({ token: tokens.accessToken });
-  }
+  async refreshToken(@Req() request: Request, @Res() response: Response) {}
 
   @AuthPermissions([])
killedBy: AuthController refreshToken should refresh tokens and set new refresh token in cookies
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"cookies": {"refreshToken": "old-refresh-token"}}

Number of calls: 0

[Killed] BlockStatement
src/api/auth/auth.controller.ts:88:57
     status: 401,
     description: 'Invalid credentials',
   })
-  async changePassword(@Body() data: ChangePasswordDTO) {
-    const userId = this.cls.get('user.id');
-    await this.authService.changePassword(userId, data);
-    return { message: 'Password changed successfully' };
-  }
+  async changePassword(@Body() data: ChangePasswordDTO) {}
 
   @AuthPermissions([])
killedBy: AuthController changePassword should change the password for the logged-in user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user.id"

Number of calls: 0

[Survived] StringLiteral
src/api/auth/auth.controller.ts:91:23
   async changePassword(@Body() data: ChangePasswordDTO) {
     const userId = this.cls.get('user.id');
     await this.authService.changePassword(userId, data);
-    return { message: 'Password changed successfully' };
+    return { message: "" };
   }
 

[Killed] BlockStatement
src/api/auth/auth.controller.ts:102:14
     status: 200,
     type: UserDto,
   })
-  async me() {
-    const userId = this.cls.get('user.id');
-    return await this.authService.me(userId);
-  }
+  async me() {}
 }
 
killedBy: AuthController me should return the current user information
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user.id"

Number of calls: 0
