[NoCoverage] BlockStatement
src/api/user/user.controller.ts:42:56
   @ApiOkResponse({
     type: [UserListDto],
   })
-  async findUsers(@Query() params: FindUsersParamsDto) {
-    return await this.userService.findUsers(params);
-  }
+  async findUsers(@Query() params: FindUsersParamsDto) {}
 
   @UserAction(Action.FIND_USER)

[NoCoverage] BlockStatement
src/api/user/user.controller.ts:57:43
     status: 404,
     description: 'User not found',
   })
-  async findUser(@Param('id') id: string) {
-    return await this.userService.findUser(id);
-  }
+  async findUser(@Param('id') id: string) {}
 
   @UserAction(Action.FIRE_USER)

[NoCoverage] BlockStatement
src/api/user/user.controller.ts:73:43
     status: 400,
     description: 'User is already fired',
   })
-  async fireUser(@Param('id') id: string) {
-    return await this.userService.fireUser(id);
-  }
+  async fireUser(@Param('id') id: string) {}
 
   @UserAction(Action.RESTORE_USER)

[NoCoverage] BlockStatement
src/api/user/user.controller.ts:89:46
     status: 400,
     description: 'User is not fired',
   })
-  async restoreUser(@Param('id') id: string) {
-    return await this.userService.restoreUser(id);
-  }
+  async restoreUser(@Param('id') id: string) {}
 
   @UserAction(Action.CHANGE_USER_ROLE)

[NoCoverage] BlockStatement
src/api/user/user.controller.ts:101:78
   @ApiOkResponse({
     type: UserDto,
   })
-  async changeRole(@Param('id') id: string, @Body() data: ChangeRoleDataDto) {
-    return await this.userService.changeRole(id, data);
-  }
+  async changeRole(@Param('id') id: string, @Body() data: ChangeRoleDataDto) {}
 
   @UserAction(Action.CREATE_USER)

[NoCoverage] BlockStatement
src/api/user/user.controller.ts:117:53
     status: 400,
     description: 'Email is already taken',
   })
-  async createUser(@Body() data: CreateUserDataDto) {
-    return await this.userService.createUser(data);
-  }
+  async createUser(@Body() data: CreateUserDataDto) {}
 
   @UserAction(Action.UPDATE_USER)

[NoCoverage] BlockStatement
src/api/user/user.controller.ts:133:78
     status: 400,
     description: 'Email is already taken',
   })
-  async updateUser(@Param('id') id: string, @Body() data: UpdateUserDataDto) {
-    return await this.userService.updateUser(id, data);
-  }
+  async updateUser(@Param('id') id: string, @Body() data: UpdateUserDataDto) {}
 }
 
