[Killed] BlockStatement
src/api/user/user.service.ts:30:5
     prisma: PrismaService,
     private readonly userMapper: UserMapper,
     private readonly roleService: RoleService,
-  ) {
-    this.userRepo = prisma.user;
-  }
+  ) {}
 
   private async existsUser(email: string) {
killedBy: UserService createUser should create a user
statusReason: TypeError: Cannot read properties of undefined (reading 'findFirst')

[Killed] BlockStatement
src/api/user/user.service.ts:34:43
     this.userRepo = prisma.user;
   }
 
-  private async existsUser(email: string) {
-    const user = await this.userRepo.findFirst({ where: { email } });
-    return !!user;
-  }
+  private async existsUser(email: string) {}
 
   async findUsers(params: FindUsersParams) {
killedBy: UserService createUser should throw BadRequestException if user with email already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Survived] ObjectLiteral
src/api/user/user.service.ts:35:48
   }
 
   private async existsUser(email: string) {
-    const user = await this.userRepo.findFirst({ where: { email } });
+    const user = await this.userRepo.findFirst({});
     return !!user;
   }

[Survived] ObjectLiteral
src/api/user/user.service.ts:35:57
   }
 
   private async existsUser(email: string) {
-    const user = await this.userRepo.findFirst({ where: { email } });
+    const user = await this.userRepo.findFirst({ where: {} });
     return !!user;
   }

[Killed] BooleanLiteral
src/api/user/user.service.ts:36:13
 
   private async existsUser(email: string) {
     const user = await this.userRepo.findFirst({ where: { email } });
-    return !!user;
+    return !user;
   }
 
killedBy: UserService createUser should create a user
statusReason: BadRequestException: Email is already taken

[Killed] ObjectLiteral
src/api/user/user.service.ts:51:19
       orderBy,
       orderDirection,
     } = params;
-    const where = {
-      email: { contains: email },
-      firstName: { contains: firstName },
-      lastName: { contains: lastName },
-      status,
-      roleId,
-    };
+    const where = {};
     const [users, total] = await Promise.all([
       this.userRepo.findMany({
killedBy: UserService findUsers should return a list of users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,19 +5,7 @@
    "orderBy": Object {
      "createdAt": "asc",

[Killed] ObjectLiteral
src/api/user/user.service.ts:53:18
     } = params;
     const where = {
       email: { contains: email },
-      firstName: { contains: firstName },
+      firstName: {},
       lastName: { contains: lastName },
       status,
killedBy: UserService findUsers should return a list of users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -9,13 +9,11 @@
    "take": 10,
    "where": Object {

[Killed] UnaryOperator
src/api/user/user.service.ts:65:15
           [orderBy]: orderDirection,
         },
         skip: (page - 1) * pageSize,
-        take: +pageSize,
+        take: -pageSize,
         include: {
           role: true,
killedBy: UserService findUsers should return a list of users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
    },
    "orderBy": Object {

[Killed] BooleanLiteral
src/api/user/user.service.ts:67:17
         skip: (page - 1) * pageSize,
         take: +pageSize,
         include: {
-          role: true,
+          role: false,
         },
       }),
killedBy: UserService findUsers should return a list of users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "include": Object {

[Survived] ArrowFunction
src/api/user/user.service.ts:73:23
       this.userRepo.count({ where }),
     ]);
     return {
-      data: users.map((user) => this.userMapper.map(user)),
+      data: users.map(() => undefined),
       total,
     };

[Killed] BlockStatement
src/api/user/user.service.ts:78:30
     };
   }
 
-  async findUser(id: string) {
-    const user = await this.userRepo.findUnique({
-      where: { id },
-      include: {
-        role: true,
-      },
-    });
-    if (!user) throw new NotFoundException('User not found');
-    return this.userMapper.map(user);
-  }
+  async findUser(id: string) {}
 
   async findUserCredentials(
killedBy: UserService findUser should return user by id
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/api/user/user.service.ts:80:14
 
   async findUser(id: string) {
     const user = await this.userRepo.findUnique({
-      where: { id },
+      where: {},
       include: {
         role: true,
killedBy: UserService findUser should return user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "include": Object {
      "role": true,

[Killed] ObjectLiteral
src/api/user/user.service.ts:81:16
   async findUser(id: string) {
     const user = await this.userRepo.findUnique({
       where: { id },
-      include: {
-        role: true,
-      },
+      include: {},
     });
     if (!user) throw new NotFoundException('User not found');
killedBy: UserService findUser should return user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "include": Object {
-     "role": true,

[Killed] ConditionalExpression
src/api/user/user.service.ts:85:9
         role: true,
       },
     });
-    if (!user) throw new NotFoundException('User not found');
+    if (true) throw new NotFoundException('User not found');
     return this.userMapper.map(user);
   }
killedBy: UserService findUser should return user by id
statusReason: NotFoundException: User not found

[Killed] ConditionalExpression
src/api/user/user.service.ts:85:9
         role: true,
       },
     });
-    if (!user) throw new NotFoundException('User not found');
+    if (false) throw new NotFoundException('User not found');
     return this.userMapper.map(user);
   }
killedBy: UserService findUser should throw NotFoundException if user not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundException
Received constructor: TypeError

Received message: "Cannot destructure property 'password' of 'user' as it is null."

      58 |       stryCov_9fa48("1258");

[NoCoverage] BlockStatement
src/api/user/user.service.ts:91:31
 
   async findUserCredentials(
     where: Prisma.UserWhereUniqueInput,
-  ): Promise<UserCredentials> {
-    const creds = await this.userRepo.findUnique({
-      where,
-      select: {
-        id: true,
-        email: true,
-        password: true,
-      },
-    });
-    return creds;
-  }
+  ): Promise<UserCredentials> {}
 
   async fireUser(id: string) {

[NoCoverage] BooleanLiteral
src/api/user/user.service.ts:96:16
       where,
       select: {
         id: true,
-        email: true,
+        email: false,
         password: true,
       },

[NoCoverage] BooleanLiteral
src/api/user/user.service.ts:97:19
       select: {
         id: true,
         email: true,
-        password: true,
+        password: false,
       },
     });

[Killed] BlockStatement
src/api/user/user.service.ts:103:30
     return creds;
   }
 
-  async fireUser(id: string) {
-    const user = await this.findUser(id);
-    if (user.status === StatusEnum.FIRED)
-      throw new BadRequestException('User is already fired');
-    const firedUser = await this.userRepo.update({
-      where: { id },
-      data: { status: StatusEnum.FIRED },
-      include: {
-        role: true,
-      },
-    });
-    return this.userMapper.map(firedUser);
-  }
+  async fireUser(id: string) {}
 
   async restoreUser(id: string) {
killedBy: UserService fireUser should fire user
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/api/user/user.service.ts:105:9
 
   async fireUser(id: string) {
     const user = await this.findUser(id);
-    if (user.status === StatusEnum.FIRED)
+    if (true)
       throw new BadRequestException('User is already fired');
     const firedUser = await this.userRepo.update({
killedBy: UserService fireUser should fire user
statusReason: BadRequestException: User is already fired

[Killed] EqualityOperator
src/api/user/user.service.ts:105:9
 
   async fireUser(id: string) {
     const user = await this.findUser(id);
-    if (user.status === StatusEnum.FIRED)
+    if (user.status !== StatusEnum.FIRED)
       throw new BadRequestException('User is already fired');
     const firedUser = await this.userRepo.update({
killedBy: UserService fireUser should fire user
statusReason: BadRequestException: User is already fired

[NoCoverage] StringLiteral
src/api/user/user.service.ts:106:37
   async fireUser(id: string) {
     const user = await this.findUser(id);
     if (user.status === StatusEnum.FIRED)
-      throw new BadRequestException('User is already fired');
+      throw new BadRequestException("");
     const firedUser = await this.userRepo.update({
       where: { id },

[Survived] ObjectLiteral
src/api/user/user.service.ts:107:50
     const user = await this.findUser(id);
     if (user.status === StatusEnum.FIRED)
       throw new BadRequestException('User is already fired');
-    const firedUser = await this.userRepo.update({
-      where: { id },
-      data: { status: StatusEnum.FIRED },
-      include: {
-        role: true,
-      },
-    });
+    const firedUser = await this.userRepo.update({});
     return this.userMapper.map(firedUser);
   }

[Survived] ObjectLiteral
src/api/user/user.service.ts:108:14
     if (user.status === StatusEnum.FIRED)
       throw new BadRequestException('User is already fired');
     const firedUser = await this.userRepo.update({
-      where: { id },
+      where: {},
       data: { status: StatusEnum.FIRED },
       include: {

[Killed] BlockStatement
src/api/user/user.service.ts:117:33
     return this.userMapper.map(firedUser);
   }
 
-  async restoreUser(id: string) {
-    const user = await this.findUser(id);
-    if (user.status !== StatusEnum.FIRED)
-      throw new BadRequestException('User is not fired');
-    const restoredUser = await this.userRepo.update({
-      where: { id },
-      data: { status: StatusEnum.ACTIVE },
-      include: {
-        role: true,
-      },
-    });
-    return this.userMapper.map(restoredUser);
-  }
+  async restoreUser(id: string) {}
 
   async changeRole(id: string, data: ChangeRoleData) {
killedBy: UserService restoreUser should restore user
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/api/user/user.service.ts:119:9
 
   async restoreUser(id: string) {
     const user = await this.findUser(id);
-    if (user.status !== StatusEnum.FIRED)
+    if (user.status === StatusEnum.FIRED)
       throw new BadRequestException('User is not fired');
     const restoredUser = await this.userRepo.update({
killedBy: UserService restoreUser should restore user
statusReason: BadRequestException: User is not fired

[Killed] ConditionalExpression
src/api/user/user.service.ts:119:9
 
   async restoreUser(id: string) {
     const user = await this.findUser(id);
-    if (user.status !== StatusEnum.FIRED)
+    if (true)
       throw new BadRequestException('User is not fired');
     const restoredUser = await this.userRepo.update({
killedBy: UserService restoreUser should restore user
statusReason: BadRequestException: User is not fired

[Survived] StringLiteral
src/api/user/user.service.ts:120:37
   async restoreUser(id: string) {
     const user = await this.findUser(id);
     if (user.status !== StatusEnum.FIRED)
-      throw new BadRequestException('User is not fired');
+      throw new BadRequestException("");
     const restoredUser = await this.userRepo.update({
       where: { id },

[Killed] BlockStatement
src/api/user/user.service.ts:131:54
     return this.userMapper.map(restoredUser);
   }
 
-  async changeRole(id: string, data: ChangeRoleData) {
-    const { roleId } = data;
-    const user = await this.findUser(id);
-    const curRole = user.role;
-    const newRole = await this.roleService.forkRole(roleId);
-    const updatedUser = await this.userRepo.update({
-      where: { id },
-      data: { role: { connect: { id: newRole.id } } },
-      include: {
-        role: true,
-      },
-    });
-    await this.roleService.deleteRole(curRole.id, false).catch(() => {
-      this.logger.warn({
-        message: 'Skipped changed role cleanup. Role cannot be deleted',
-        context: {
-          userId: id,
-          curRoleId: curRole.id,
-          newRoleId: newRole.id,
-        },
-      });
-    });
-    return this.userMapper.map(updatedUser);
-  }
+  async changeRole(id: string, data: ChangeRoleData) {}
 
   async createUser(data: CreateUserData) {
killedBy: UserService changeRole should change user role
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] ObjectLiteral
src/api/user/user.service.ts:136:52
     const user = await this.findUser(id);
     const curRole = user.role;
     const newRole = await this.roleService.forkRole(roleId);
-    const updatedUser = await this.userRepo.update({
-      where: { id },
-      data: { role: { connect: { id: newRole.id } } },
-      include: {
-        role: true,
-      },
-    });
+    const updatedUser = await this.userRepo.update({});
     await this.roleService.deleteRole(curRole.id, false).catch(() => {
       this.logger.warn({

[Survived] ObjectLiteral
src/api/user/user.service.ts:137:14
     const curRole = user.role;
     const newRole = await this.roleService.forkRole(roleId);
     const updatedUser = await this.userRepo.update({
-      where: { id },
+      where: {},
       data: { role: { connect: { id: newRole.id } } },
       include: {

[Killed] BlockStatement
src/api/user/user.service.ts:143:70
         role: true,
       },
     });
-    await this.roleService.deleteRole(curRole.id, false).catch(() => {
-      this.logger.warn({
-        message: 'Skipped changed role cleanup. Role cannot be deleted',
-        context: {
-          userId: id,
-          curRoleId: curRole.id,
-          newRoleId: newRole.id,
-        },
-      });
-    });
+    await this.roleService.deleteRole(curRole.id, false).catch(() => {});
     return this.userMapper.map(updatedUser);
   }
killedBy: UserService changeRole should log a warning if role deletion fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
src/api/user/user.service.ts:143:51
         role: true,
       },
     });
-    await this.roleService.deleteRole(curRole.id, false).catch(() => {
+    await this.roleService.deleteRole(curRole.id, true).catch(() => {
       this.logger.warn({
         message: 'Skipped changed role cleanup. Role cannot be deleted',

[Survived] StringLiteral
src/api/user/user.service.ts:145:18
     });
     await this.roleService.deleteRole(curRole.id, false).catch(() => {
       this.logger.warn({
-        message: 'Skipped changed role cleanup. Role cannot be deleted',
+        message: "",
         context: {
           userId: id,

[Killed] BlockStatement
src/api/user/user.service.ts:156:42
     return this.userMapper.map(updatedUser);
   }
 
-  async createUser(data: CreateUserData) {
-    const { roleId, ...userData } = data;
-    const exists = await this.existsUser(userData.email);
-    if (exists) throw new BadRequestException('Email is already taken');
-    const role = await this.roleService.forkRole(roleId);
-    const hashedPassword = await hashPassword(userData.password);
-    const user = await this.userRepo.create({
-      data: {
-        ...userData,
-        password: hashedPassword,
-        role: { connect: { id: role.id } },
-      },
-      include: {
-        role: true,
-      },
-    });
-    return this.userMapper.map(user);
-  }
+  async createUser(data: CreateUserData) {}
 
   async updateUser(id: string, data: UpdateUserData) {
killedBy: UserService createUser should create a user
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/api/user/user.service.ts:159:9
   async createUser(data: CreateUserData) {
     const { roleId, ...userData } = data;
     const exists = await this.existsUser(userData.email);
-    if (exists) throw new BadRequestException('Email is already taken');
+    if (true) throw new BadRequestException('Email is already taken');
     const role = await this.roleService.forkRole(roleId);
     const hashedPassword = await hashPassword(userData.password);
killedBy: UserService createUser should create a user
statusReason: BadRequestException: Email is already taken

[Killed] ConditionalExpression
src/api/user/user.service.ts:159:9
   async createUser(data: CreateUserData) {
     const { roleId, ...userData } = data;
     const exists = await this.existsUser(userData.email);
-    if (exists) throw new BadRequestException('Email is already taken');
+    if (false) throw new BadRequestException('Email is already taken');
     const role = await this.roleService.forkRole(roleId);
     const hashedPassword = await hashPassword(userData.password);
killedBy: UserService createUser should throw BadRequestException if user with email already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Survived] ObjectLiteral
src/api/user/user.service.ts:166:26
       data: {
         ...userData,
         password: hashedPassword,
-        role: { connect: { id: role.id } },
+        role: { connect: {} },
       },
       include: {

[Killed] BlockStatement
src/api/user/user.service.ts:175:54
     return this.userMapper.map(user);
   }
 
-  async updateUser(id: string, data: UpdateUserData) {
-    const { email, shiftSchedule, ...userData } = data;
-    if (email) {
-      const exists = await this.existsUser(email);
-      if (exists) throw new BadRequestException('Email is already taken');
-    }
-    const updatedUser = await this.userRepo.update({
-      where: { id },
-      data: {
-        ...userData,
-        shiftSchedule: shiftSchedule && JSON.stringify(shiftSchedule),
-      },
-      include: {
-        role: true,
-      },
-    });
-    return this.userMapper.map(updatedUser);
-  }
+  async updateUser(id: string, data: UpdateUserData) {}
 
   async createSuperUser(data: CreateSuperUserData) {
killedBy: UserService updateUser should update a user
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] ConditionalExpression
src/api/user/user.service.ts:177:9
 
   async updateUser(id: string, data: UpdateUserData) {
     const { email, shiftSchedule, ...userData } = data;
-    if (email) {
+    if (false) {
       const exists = await this.existsUser(email);
       if (exists) throw new BadRequestException('Email is already taken');

[NoCoverage] BlockStatement
src/api/user/user.service.ts:177:16
 
   async updateUser(id: string, data: UpdateUserData) {
     const { email, shiftSchedule, ...userData } = data;
-    if (email) {
-      const exists = await this.existsUser(email);
-      if (exists) throw new BadRequestException('Email is already taken');
-    }
+    if (email) {}
     const updatedUser = await this.userRepo.update({
       where: { id },

[NoCoverage] ConditionalExpression
src/api/user/user.service.ts:179:11
     const { email, shiftSchedule, ...userData } = data;
     if (email) {
       const exists = await this.existsUser(email);
-      if (exists) throw new BadRequestException('Email is already taken');
+      if (true) throw new BadRequestException('Email is already taken');
     }
     const updatedUser = await this.userRepo.update({

[NoCoverage] ConditionalExpression
src/api/user/user.service.ts:179:11
     const { email, shiftSchedule, ...userData } = data;
     if (email) {
       const exists = await this.existsUser(email);
-      if (exists) throw new BadRequestException('Email is already taken');
+      if (false) throw new BadRequestException('Email is already taken');
     }
     const updatedUser = await this.userRepo.update({

[Survived] ObjectLiteral
src/api/user/user.service.ts:181:52
       const exists = await this.existsUser(email);
       if (exists) throw new BadRequestException('Email is already taken');
     }
-    const updatedUser = await this.userRepo.update({
-      where: { id },
-      data: {
-        ...userData,
-        shiftSchedule: shiftSchedule && JSON.stringify(shiftSchedule),
-      },
-      include: {
-        role: true,
-      },
-    });
+    const updatedUser = await this.userRepo.update({});
     return this.userMapper.map(updatedUser);
   }

[Survived] ConditionalExpression
src/api/user/user.service.ts:185:24
       where: { id },
       data: {
         ...userData,
-        shiftSchedule: shiftSchedule && JSON.stringify(shiftSchedule),
+        shiftSchedule: true,
       },
       include: {

[Survived] ConditionalExpression
src/api/user/user.service.ts:185:24
       where: { id },
       data: {
         ...userData,
-        shiftSchedule: shiftSchedule && JSON.stringify(shiftSchedule),
+        shiftSchedule: false,
       },
       include: {

[Survived] ObjectLiteral
src/api/user/user.service.ts:187:16
         ...userData,
         shiftSchedule: shiftSchedule && JSON.stringify(shiftSchedule),
       },
-      include: {
-        role: true,
-      },
+      include: {},
     });
     return this.userMapper.map(updatedUser);

[NoCoverage] BlockStatement
src/api/user/user.service.ts:194:52
     return this.userMapper.map(updatedUser);
   }
 
-  async createSuperUser(data: CreateSuperUserData) {
-    const role = await this.roleService.findSuperuserRole();
-    await this.createUser({ ...data, roleId: role.id });
-  }
+  async createSuperUser(data: CreateSuperUserData) {}
 }
 
