[NoCoverage] BooleanLiteral
api/warehouse/dto/create-warehouse.dto.ts:50:24
   })
   @IsOptional()
   @IsBoolean()
-  isActive?: boolean = true;
+  isActive?: boolean = false;
 
   @ApiProperty({ description: 'URL фото складу', required: false })
