[NoCoverage] BlockStatement
src/cli.ts:4:28
 import { CommandFactory } from 'nest-commander';
 import { CliModule } from './cli.module';
 
-async function bootstrap() {
-  await CommandFactory.run(CliModule);
-}
+async function bootstrap() {}
 
 bootstrap();
