[NoCoverage] BlockStatement
src/commands/sudo.command.ts:15:78
     super();
   }
 
-  async run([firstName, lastName, email, password]: string[]): Promise<void> {
-    await this.userService.createSuperUser({
-      firstName,
-      lastName,
-      email,
-      password,
-    });
-  }
+  async run([firstName, lastName, email, password]: string[]): Promise<void> {}
 }
 
