[NoCoverage] BlockStatement
src/database/prisma.service.ts:9:24
   extends PrismaClient
   implements OnModuleInit, OnModuleDestroy
 {
-  async onModuleInit() {
-    await this.$connect();
-  }
+  async onModuleInit() {}
 
   async onModuleDestroy() {

[NoCoverage] BlockStatement
src/database/prisma.service.ts:13:27
     await this.$connect();
   }
 
-  async onModuleDestroy() {
-    await this.$disconnect();
-  }
+  async onModuleDestroy() {}
 }
 
