[NoCoverage] ArrowFunction
src/lib/configs/server.config.ts:3:16
 import { ServerConfig } from '../types/configs/server';
 
-export default (): { server: ServerConfig } => ({
-  server: {
-    port: parseInt(process.env.PORT, 10) ?? 3000,
-    host: process.env.HOST ?? '0.0.0.0',
-    cors: {
-      origin: process.env.CORS_ORIGIN ?? '*',
-      methods: process.env.CORS_METHODS ?? 'GET,PUT,POST,DELETE,PATCH,OPTIONS',
-    },
-  },
-});
+export default () => undefined;
 

[NoCoverage] ObjectLiteral
src/lib/configs/server.config.ts:3:49
 import { ServerConfig } from '../types/configs/server';
 
-export default (): { server: ServerConfig } => ({
-  server: {
-    port: parseInt(process.env.PORT, 10) ?? 3000,
-    host: process.env.HOST ?? '0.0.0.0',
-    cors: {
-      origin: process.env.CORS_ORIGIN ?? '*',
-      methods: process.env.CORS_METHODS ?? 'GET,PUT,POST,DELETE,PATCH,OPTIONS',
-    },
-  },
-});
+export default (): { server: ServerConfig } => ({});
 

[NoCoverage] LogicalOperator
src/lib/configs/server.config.ts:5:11
 
 export default (): { server: ServerConfig } => ({
   server: {
-    port: parseInt(process.env.PORT, 10) ?? 3000,
+    port: parseInt(process.env.PORT, 10) && 3000,
     host: process.env.HOST ?? '0.0.0.0',
     cors: {

[NoCoverage] LogicalOperator
src/lib/configs/server.config.ts:6:11
 export default (): { server: ServerConfig } => ({
   server: {
     port: parseInt(process.env.PORT, 10) ?? 3000,
-    host: process.env.HOST ?? '0.0.0.0',
+    host: process.env.HOST && '0.0.0.0',
     cors: {
       origin: process.env.CORS_ORIGIN ?? '*',

[NoCoverage] StringLiteral
src/lib/configs/server.config.ts:6:31
 export default (): { server: ServerConfig } => ({
   server: {
     port: parseInt(process.env.PORT, 10) ?? 3000,
-    host: process.env.HOST ?? '0.0.0.0',
+    host: process.env.HOST ?? "",
     cors: {
       origin: process.env.CORS_ORIGIN ?? '*',

[NoCoverage] LogicalOperator
src/lib/configs/server.config.ts:8:15
     port: parseInt(process.env.PORT, 10) ?? 3000,
     host: process.env.HOST ?? '0.0.0.0',
     cors: {
-      origin: process.env.CORS_ORIGIN ?? '*',
+      origin: process.env.CORS_ORIGIN && '*',
       methods: process.env.CORS_METHODS ?? 'GET,PUT,POST,DELETE,PATCH,OPTIONS',
     },

[NoCoverage] LogicalOperator
src/lib/configs/server.config.ts:9:16
     host: process.env.HOST ?? '0.0.0.0',
     cors: {
       origin: process.env.CORS_ORIGIN ?? '*',
-      methods: process.env.CORS_METHODS ?? 'GET,PUT,POST,DELETE,PATCH,OPTIONS',
+      methods: process.env.CORS_METHODS && 'GET,PUT,POST,DELETE,PATCH,OPTIONS',
     },
   },
