[NoCoverage] ConditionalExpression
src/lib/interceptors/user-action.interceptor.ts:34:9
       ctx.getHandler(),
     );
 
-    if (!userActionCtx) return next.handle();
+    if (false) return next.handle();
 
     const { ip, body, params, query } = request;

[NoCoverage] ConditionalExpression
src/lib/interceptors/user-action.interceptor.ts:34:9
       ctx.getHandler(),
     );
 
-    if (!userActionCtx) return next.handle();
+    if (true) return next.handle();
 
     const { ip, body, params, query } = request;

[NoCoverage] StringLiteral
src/lib/interceptors/user-action.interceptor.ts:40:33
 
     const payload = { ...body, ...params, ...query };
 
-    const userId = this.cls.get('user.id');
+    const userId = this.cls.get("");
 
     return next.handle().pipe(

[NoCoverage] BlockStatement
src/lib/interceptors/user-action.interceptor.ts:43:17
     const userId = this.cls.get('user.id');
 
     return next.handle().pipe(
-      tap(() => {
-        this.journalService
-          .createUserAction({
-            ip,
-            userId,
-            action: userActionCtx.action,
-            payload,
-          })
-          .catch((error) => {
-            this.logger.error({
-              message: 'Failed to create user action',
-              error,
-            });
-          });
-      }),
+      tap(() => {}),
     );
   }

[NoCoverage] BlockStatement
src/lib/interceptors/user-action.interceptor.ts:51:29
             action: userActionCtx.action,
             payload,
           })
-          .catch((error) => {
-            this.logger.error({
-              message: 'Failed to create user action',
-              error,
-            });
-          });
+          .catch((error) => {});
       }),
     );

[NoCoverage] ObjectLiteral
src/lib/interceptors/user-action.interceptor.ts:52:31
             payload,
           })
           .catch((error) => {
-            this.logger.error({
-              message: 'Failed to create user action',
-              error,
-            });
+            this.logger.error({});
           });
       }),

[NoCoverage] StringLiteral
src/lib/interceptors/user-action.interceptor.ts:53:24
           })
           .catch((error) => {
             this.logger.error({
-              message: 'Failed to create user action',
+              message: "",
               error,
             });
