[NoCoverage] BlockStatement
src/lib/utils/cookie.ts:5:61
 import { Request, Response } from 'express';
 
 export class CookieUtils {
-  static setRefreshToken(response: Response, token: string) {
-    const refreshTtl = process.env.JWT_TTL || '18600000000000';
-    const expires = new Date(Date.now() + parseInt(refreshTtl, 10));
-
-    const oldRefreshToken = response
-      .getHeader('Set-Cookie')
-      ?.toString()
-      .includes('refreshToken');
-    if (oldRefreshToken) {
-      response.clearCookie('refreshToken', { path: '/' });
-    }
-
-    response.cookie('refreshToken', token, {
-      httpOnly: true,
-      expires,
-      path: '/',
-    });
-  }
+  static setRefreshToken(response: Response, token: string) {}
 
   static getRefreshToken(request: Request) {

[NoCoverage] LogicalOperator
src/lib/utils/cookie.ts:6:24
 
 export class CookieUtils {
   static setRefreshToken(response: Response, token: string) {
-    const refreshTtl = process.env.JWT_TTL || '18600000000000';
+    const refreshTtl = process.env.JWT_TTL && '18600000000000';
     const expires = new Date(Date.now() + parseInt(refreshTtl, 10));
 

[NoCoverage] ConditionalExpression
src/lib/utils/cookie.ts:6:24
 
 export class CookieUtils {
   static setRefreshToken(response: Response, token: string) {
-    const refreshTtl = process.env.JWT_TTL || '18600000000000';
+    const refreshTtl = false;
     const expires = new Date(Date.now() + parseInt(refreshTtl, 10));
 

[NoCoverage] ArithmeticOperator
src/lib/utils/cookie.ts:7:30
 export class CookieUtils {
   static setRefreshToken(response: Response, token: string) {
     const refreshTtl = process.env.JWT_TTL || '18600000000000';
-    const expires = new Date(Date.now() + parseInt(refreshTtl, 10));
+    const expires = new Date(Date.now() - parseInt(refreshTtl, 10));
 
     const oldRefreshToken = response

[NoCoverage] OptionalChaining
src/lib/utils/cookie.ts:9:29
     const refreshTtl = process.env.JWT_TTL || '18600000000000';
     const expires = new Date(Date.now() + parseInt(refreshTtl, 10));
 
-    const oldRefreshToken = response
-      .getHeader('Set-Cookie')
-      ?.toString()
+    const oldRefreshToken = response.getHeader('Set-Cookie').toString()
       .includes('refreshToken');
     if (oldRefreshToken) {

[NoCoverage] StringLiteral
src/lib/utils/cookie.ts:10:18
     const expires = new Date(Date.now() + parseInt(refreshTtl, 10));
 
     const oldRefreshToken = response
-      .getHeader('Set-Cookie')
+      .getHeader("")
       ?.toString()
       .includes('refreshToken');

[NoCoverage] ConditionalExpression
src/lib/utils/cookie.ts:13:9
       .getHeader('Set-Cookie')
       ?.toString()
       .includes('refreshToken');
-    if (oldRefreshToken) {
+    if (true) {
       response.clearCookie('refreshToken', { path: '/' });
     }

[NoCoverage] ConditionalExpression
src/lib/utils/cookie.ts:13:9
       .getHeader('Set-Cookie')
       ?.toString()
       .includes('refreshToken');
-    if (oldRefreshToken) {
+    if (false) {
       response.clearCookie('refreshToken', { path: '/' });
     }

[NoCoverage] StringLiteral
src/lib/utils/cookie.ts:14:28
       ?.toString()
       .includes('refreshToken');
     if (oldRefreshToken) {
-      response.clearCookie('refreshToken', { path: '/' });
+      response.clearCookie("", { path: '/' });
     }
 

[NoCoverage] BooleanLiteral
src/lib/utils/cookie.ts:18:17
     }
 
     response.cookie('refreshToken', token, {
-      httpOnly: true,
+      httpOnly: false,
       expires,
       path: '/',

[NoCoverage] BlockStatement
src/lib/utils/cookie.ts:24:44
     });
   }
 
-  static getRefreshToken(request: Request) {
-    return request.cookies['refreshToken'];
-  }
+  static getRefreshToken(request: Request) {}
 }
 

[NoCoverage] StringLiteral
src/lib/utils/cookie.ts:25:28
   }
 
   static getRefreshToken(request: Request) {
-    return request.cookies['refreshToken'];
+    return request.cookies[""];
   }
 }
