[NoCoverage] ConditionalExpression
src/lib/utils/validation.ts:3:58
 import { ValidateIf, ValidateBy } from 'class-validator';
 
-export const IsNullable = () => ValidateIf((_, value) => value !== null);
+export const IsNullable = () => ValidateIf((_, value) => true);
 
 export const IsDateDivisibleBy = (divisor: number) =>

[NoCoverage] ArrowFunction
src/lib/utils/validation.ts:3:44
 import { ValidateIf, ValidateBy } from 'class-validator';
 
-export const IsNullable = () => ValidateIf((_, value) => value !== null);
+export const IsNullable = () => ValidateIf(() => undefined);
 
 export const IsDateDivisibleBy = (divisor: number) =>

[NoCoverage] ArrowFunction
src/lib/utils/validation.ts:5:34
 
 export const IsNullable = () => ValidateIf((_, value) => value !== null);
 
-export const IsDateDivisibleBy = (divisor: number) =>
-  ValidateBy({
-    name: 'isDateDivisibleBy',
-    async: false,
-    validator: {
-      validate(value: unknown) {
-        return value instanceof Date && value.getTime() % divisor === 0;
-      },
-      defaultMessage() {
-        return `$property must be a date divisible by ${divisor}`;
-      },
-    },
-  });
+export const IsDateDivisibleBy = () => undefined;
 

[NoCoverage] StringLiteral
src/lib/utils/validation.ts:7:11
 
 export const IsDateDivisibleBy = (divisor: number) =>
   ValidateBy({
-    name: 'isDateDivisibleBy',
+    name: "",
     async: false,
     validator: {

[NoCoverage] BooleanLiteral
src/lib/utils/validation.ts:8:12
 export const IsDateDivisibleBy = (divisor: number) =>
   ValidateBy({
     name: 'isDateDivisibleBy',
-    async: false,
+    async: true,
     validator: {
       validate(value: unknown) {

[NoCoverage] BlockStatement
src/lib/utils/validation.ts:10:32
     name: 'isDateDivisibleBy',
     async: false,
     validator: {
-      validate(value: unknown) {
-        return value instanceof Date && value.getTime() % divisor === 0;
-      },
+      validate(value: unknown) {},
       defaultMessage() {
         return `$property must be a date divisible by ${divisor}`;

[NoCoverage] ConditionalExpression
src/lib/utils/validation.ts:11:41
     async: false,
     validator: {
       validate(value: unknown) {
-        return value instanceof Date && value.getTime() % divisor === 0;
+        return value instanceof Date && true;
       },
       defaultMessage() {

[NoCoverage] ConditionalExpression
src/lib/utils/validation.ts:11:16
     async: false,
     validator: {
       validate(value: unknown) {
-        return value instanceof Date && value.getTime() % divisor === 0;
+        return false;
       },
       defaultMessage() {

[NoCoverage] BlockStatement
src/lib/utils/validation.ts:13:24
       validate(value: unknown) {
         return value instanceof Date && value.getTime() % divisor === 0;
       },
-      defaultMessage() {
-        return `$property must be a date divisible by ${divisor}`;
-      },
+      defaultMessage() {},
     },
   });
