[NoCoverage] BooleanLiteral
src/main.ts:13:65
 import { ServerConfig } from './lib/types/configs/server';
 
 async function bootstrap() {
-  const app = await NestFactory.create(AppModule, { bufferLogs: true });
+  const app = await NestFactory.create(AppModule, { bufferLogs: false });
   const express: ExpressAdapter = app.getHttpAdapter().getInstance();
   express.set('trust proxy', true);

[NoCoverage] ObjectLiteral
src/main.ts:13:51
 import { ServerConfig } from './lib/types/configs/server';
 
 async function bootstrap() {
-  const app = await NestFactory.create(AppModule, { bufferLogs: true });
+  const app = await NestFactory.create(AppModule, {});
   const express: ExpressAdapter = app.getHttpAdapter().getInstance();
   express.set('trust proxy', true);

[NoCoverage] BooleanLiteral
src/main.ts:15:30
 async function bootstrap() {
   const app = await NestFactory.create(AppModule, { bufferLogs: true });
   const express: ExpressAdapter = app.getHttpAdapter().getInstance();
-  express.set('trust proxy', true);
+  express.set('trust proxy', false);
   const logger = app.get(Logger);
   app.useLogger(logger);

[NoCoverage] StringLiteral
src/main.ts:15:15
 async function bootstrap() {
   const app = await NestFactory.create(AppModule, { bufferLogs: true });
   const express: ExpressAdapter = app.getHttpAdapter().getInstance();
-  express.set('trust proxy', true);
+  express.set("", true);
   const logger = app.get(Logger);
   app.useLogger(logger);

[NoCoverage] ObjectLiteral
src/main.ts:19:27
   const logger = app.get(Logger);
   app.useLogger(logger);
   app.use(cookieParser());
-  app.use(bodyParser.json({ limit: '50mb' }));
+  app.use(bodyParser.json({}));
   app.use(bodyParser.urlencoded({ limit: '50mb', extended: true }));
   const configService = app.get<ConfigService>(ConfigService);

[NoCoverage] StringLiteral
src/main.ts:19:36
   const logger = app.get(Logger);
   app.useLogger(logger);
   app.use(cookieParser());
-  app.use(bodyParser.json({ limit: '50mb' }));
+  app.use(bodyParser.json({ limit: "" }));
   app.use(bodyParser.urlencoded({ limit: '50mb', extended: true }));
   const configService = app.get<ConfigService>(ConfigService);

[NoCoverage] BooleanLiteral
src/main.ts:20:60
   app.useLogger(logger);
   app.use(cookieParser());
   app.use(bodyParser.json({ limit: '50mb' }));
-  app.use(bodyParser.urlencoded({ limit: '50mb', extended: true }));
+  app.use(bodyParser.urlencoded({ limit: '50mb', extended: false }));
   const configService = app.get<ConfigService>(ConfigService);
   const serverConfig = configService.get<ServerConfig>('server');

[NoCoverage] ObjectLiteral
src/main.ts:20:33
   app.useLogger(logger);
   app.use(cookieParser());
   app.use(bodyParser.json({ limit: '50mb' }));
-  app.use(bodyParser.urlencoded({ limit: '50mb', extended: true }));
+  app.use(bodyParser.urlencoded({}));
   const configService = app.get<ConfigService>(ConfigService);
   const serverConfig = configService.get<ServerConfig>('server');

[NoCoverage] BooleanLiteral
src/main.ts:26:18
   app.enableCors({
     origin: serverConfig.cors.origin,
     methods: serverConfig.cors.methods,
-    credentials: true,
+    credentials: false,
   });
   app.useGlobalPipes(

[NoCoverage] BooleanLiteral
src/main.ts:31:35
   app.useGlobalPipes(
     new ValidationPipe({
       transformOptions: {
-        enableImplicitConversion: true,
+        enableImplicitConversion: false,
       },
       transform: true,

[NoCoverage] BooleanLiteral
src/main.ts:33:18
       transformOptions: {
         enableImplicitConversion: true,
       },
-      transform: true,
+      transform: false,
       whitelist: true,
       forbidNonWhitelisted: true,

[NoCoverage] BooleanLiteral
src/main.ts:34:18
         enableImplicitConversion: true,
       },
       transform: true,
-      whitelist: true,
+      whitelist: false,
       forbidNonWhitelisted: true,
     }),

[NoCoverage] StringLiteral
src/main.ts:39:15
     }),
   );
   const options = new DocumentBuilder()
-    .setTitle('API WMS Doxa docs')
+    .setTitle("")
     .setDescription('WMS Doxa API documentation')
     .setVersion('0.1')

[NoCoverage] StringLiteral
src/main.ts:42:18
     .setTitle('API WMS Doxa docs')
     .setDescription('WMS Doxa API documentation')
     .setVersion('0.1')
-    .addSecurity('bearer', {
+    .addSecurity("", {
       type: 'http',
       scheme: 'bearer',

[NoCoverage] StringLiteral
src/main.ts:43:13
     .setDescription('WMS Doxa API documentation')
     .setVersion('0.1')
     .addSecurity('bearer', {
-      type: 'http',
+      type: "",
       scheme: 'bearer',
     })

[NoCoverage] BlockStatement
src/main.ts:49:39
     .build();
   const document = SwaggerModule.createDocument(app, options);
   SwaggerModule.setup('api', app, document);
-  app.listen(serverConfig.port, () => {
-    logger.log(
-      `Docs available at http://${serverConfig.host}:${serverConfig.port}/api`,
-    );
-    logger.log(
-      `Server listening at http://${serverConfig.host}:${serverConfig.port}`,
-    );
-  });
+  app.listen(serverConfig.port, () => {});
 }
 
