[Killed] BlockStatement
src/api/batch/batch.controller.ts:43:77
     status: 201,
     type: BatchDto,
   })
-  async createBatch(@Body() createBatchDto: CreateBatchDTO): Promise<Batch> {
-    return await this.batchService.createBatch(createBatchDto);
-  }
+  async createBatch(@Body() createBatchDto: CreateBatchDTO): Promise<Batch> {}
 
   @UserAction(Action.FIND_BATCH)
killedBy: BatchController createBatch should create a new batch
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/batch/batch.controller.ts:58:63
     status: 404,
     description: 'Batch not found',
   })
-  async getBatchById(@Param('id') id: string): Promise<Batch> {
-    return await this.batchService.getBatchById(id);
-  }
+  async getBatchById(@Param('id') id: string): Promise<Batch> {}
 
   @UserAction(Action.UPDATE_BATCH)
killedBy: BatchController getBatchById should return a batch by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/batch/batch.controller.ts:72:21
   async updateBatch(
     @Param('id') id: string,
     @Body() updateBatchDto: UpdateBatchDTO,
-  ): Promise<Batch> {
-    return await this.batchService.updateBatch(id, updateBatchDto);
-  }
+  ): Promise<Batch> {}
 
   @UserAction(Action.DELETE_BATCH)
killedBy: BatchController updateBatch should update a batch by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/batch/batch.controller.ts:89:76
       },
     },
   })
-  async deleteBatch(@Param('id') id: string): Promise<{ message: string }> {
-    return await this.batchService.deleteBatch(id);
-  }
+  async deleteBatch(@Param('id') id: string): Promise<{ message: string }> {}
 
   @UserAction(Action.FIND_BATCHES)
killedBy: BatchController deleteBatch should delete a batch by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Batch batch-id-1 deleted successfully"}
Received: undefined

[Killed] BlockStatement
src/api/batch/batch.controller.ts:102:48
   })
   async getAllBatches(
     @Query() query: FindBatchesParamsDTO,
-  ): Promise<{ data: Batch[]; total: number }> {
-    return await this.batchService.getAllBatches(query);
-  }
+  ): Promise<{ data: Batch[]; total: number }> {}
 }
 
killedBy: BatchController getAllBatches should return a list of batches
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
