[Killed] BlockStatement
src/api/batch/batch.service.ts:13:55
   private readonly logger = new Logger(BatchService.name);
   private readonly batchRepo: Prisma.BatchDelegate;
 
-  constructor(private readonly prisma: PrismaService) {
-    this.batchRepo = prisma.batch;
-  }
+  constructor(private readonly prisma: PrismaService) {}
 
   async createBatch(createBatchDto: CreateBatchDTO) {
killedBy: BatchService createBatch should create a batch
statusReason: TypeError: Cannot read properties of undefined (reading 'create')

[Killed] BlockStatement
src/api/batch/batch.service.ts:17:53
     this.batchRepo = prisma.batch;
   }
 
-  async createBatch(createBatchDto: CreateBatchDTO) {
-    const batch = await this.batchRepo.create({
-      data: createBatchDto,
-    });
-    this.logger.log(`Batch created with id: ${batch.id}`);
-    return batch;
-  }
+  async createBatch(createBatchDto: CreateBatchDTO) {}
 
   async getBatchById(id: string) {
killedBy: BatchService createBatch should create a batch
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/batch/batch.service.ts:25:34
     return batch;
   }
 
-  async getBatchById(id: string) {
-    const batch = await this.batchRepo.findUnique({ where: { id } });
-    if (!batch) throw new NotFoundException(`Batch with ID ${id} not found`);
-    return batch;
-  }
+  async getBatchById(id: string) {}
 
   async updateBatch(id: string, updateBatchDto: UpdateBatchDTO) {
killedBy: BatchService getBatchById should return a batch by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ObjectLiteral
src/api/batch/batch.service.ts:26:51
   }
 
   async getBatchById(id: string) {
-    const batch = await this.batchRepo.findUnique({ where: { id } });
+    const batch = await this.batchRepo.findUnique({});
     if (!batch) throw new NotFoundException(`Batch with ID ${id} not found`);
     return batch;
killedBy: BatchService getBatchById should return a batch by ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "batch-id-1",

[Killed] BooleanLiteral
src/api/batch/batch.service.ts:27:9
 
   async getBatchById(id: string) {
     const batch = await this.batchRepo.findUnique({ where: { id } });
-    if (!batch) throw new NotFoundException(`Batch with ID ${id} not found`);
+    if (batch) throw new NotFoundException(`Batch with ID ${id} not found`);
     return batch;
   }
killedBy: BatchService getBatchById should return a batch by ID
statusReason: NotFoundException: Batch with ID batch-id-1 not found

[Killed] ConditionalExpression
src/api/batch/batch.service.ts:27:9
 
   async getBatchById(id: string) {
     const batch = await this.batchRepo.findUnique({ where: { id } });
-    if (!batch) throw new NotFoundException(`Batch with ID ${id} not found`);
+    if (false) throw new NotFoundException(`Batch with ID ${id} not found`);
     return batch;
   }
killedBy: BatchService getBatchById should throw NotFoundException if batch not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/api/batch/batch.service.ts:31:65
     return batch;
   }
 
-  async updateBatch(id: string, updateBatchDto: UpdateBatchDTO) {
-    const batch = await this.batchRepo.update({
-      where: { id },
-      data: updateBatchDto,
-    });
-    this.logger.log(`Batch updated with id: ${batch.id}`);
-    return batch;
-  }
+  async updateBatch(id: string, updateBatchDto: UpdateBatchDTO) {}
 
   async deleteBatch(id: string) {
killedBy: BatchService updateBatch should update a batch
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ObjectLiteral
src/api/batch/batch.service.ts:33:14
 
   async updateBatch(id: string, updateBatchDto: UpdateBatchDTO) {
     const batch = await this.batchRepo.update({
-      where: { id },
+      where: {},
       data: updateBatchDto,
     });
killedBy: BatchService updateBatch should update a batch
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "quantity": 150,

[Survived] StringLiteral
src/api/batch/batch.service.ts:36:21
       where: { id },
       data: updateBatchDto,
     });
-    this.logger.log(`Batch updated with id: ${batch.id}`);
+    this.logger.log(``);
     return batch;
   }

[Killed] BlockStatement
src/api/batch/batch.service.ts:40:33
     return batch;
   }
 
-  async deleteBatch(id: string) {
-    await this.getBatchById(id);
-    await this.batchRepo.delete({ where: { id } });
-    this.logger.log(`Batch deleted with id: ${id}`);
-    return { message: `Batch with id ${id} deleted successfully` };
-  }
+  async deleteBatch(id: string) {}
 
   async getAllBatches(params: FindBatchesParamsDTO) {
killedBy: BatchService deleteBatch should delete a batch by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Batch with id batch-id-1 deleted successfully"}
Received: undefined

[Killed] ObjectLiteral
src/api/batch/batch.service.ts:42:33
 
   async deleteBatch(id: string) {
     await this.getBatchById(id);
-    await this.batchRepo.delete({ where: { id } });
+    await this.batchRepo.delete({});
     this.logger.log(`Batch deleted with id: ${id}`);
     return { message: `Batch with id ${id} deleted successfully` };
killedBy: BatchService deleteBatch should delete a batch by ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "batch-id-1",

[Survived] StringLiteral
src/api/batch/batch.service.ts:43:21
   async deleteBatch(id: string) {
     await this.getBatchById(id);
     await this.batchRepo.delete({ where: { id } });
-    this.logger.log(`Batch deleted with id: ${id}`);
+    this.logger.log(``);
     return { message: `Batch with id ${id} deleted successfully` };
   }

[Killed] ObjectLiteral
src/api/batch/batch.service.ts:70:51
       position,
     };
 
-    const batches = await this.batchRepo.findMany({
-      where,
-      orderBy: {
-        [orderBy]: orderDirection,
-      },
-      skip: (page - 1) * pageSize,
-      take: Number(pageSize),
-    });
+    const batches = await this.batchRepo.findMany({});
 
     const total = await this.batchRepo.count({ where });
killedBy: BatchService getAllBatches should return a list of batches with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "orderBy": Object {
-     "createdAt": "asc",
