[Killed] BlockStatement
src/api/items/item.controller.ts:43:73
     status: 201,
     type: ItemDto,
   })
-  async createItem(@Body() createItemDto: CreateItemDTO): Promise<Item> {
-    return await this.itemService.createItem(createItemDto);
-  }
+  async createItem(@Body() createItemDto: CreateItemDTO): Promise<Item> {}
 
   @UserAction(Action.FIND_ITEM)
killedBy: ItemController createItem should create a new item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/items/item.controller.ts:58:61
     status: 404,
     description: 'Item not found',
   })
-  async getItemById(@Param('id') id: string): Promise<Item> {
-    return await this.itemService.getItemById(id);
-  }
+  async getItemById(@Param('id') id: string): Promise<Item> {}
 
   @UserAction(Action.UPDATE_ITEM)
killedBy: ItemController getItemById should return an item by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/items/item.controller.ts:72:20
   async updateItem(
     @Param('id') id: string,
     @Body() updateItemDto: UpdateItemDTO,
-  ): Promise<Item> {
-    return await this.itemService.updateItem(id, updateItemDto);
-  }
+  ): Promise<Item> {}
 
   @UserAction(Action.DELETE_ITEM)
killedBy: ItemController updateItem should update an item by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/items/item.controller.ts:89:75
       },
     },
   })
-  async deleteItem(@Param('id') id: string): Promise<{ message: string }> {
-    return await this.itemService.deleteItem(id);
-  }
+  async deleteItem(@Param('id') id: string): Promise<{ message: string }> {}
 
   @UserAction(Action.FIND_ITEMS)
killedBy: ItemController deleteItem should delete an item by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Item item-id-1 deleted successfully"}
Received: undefined

[Killed] BlockStatement
src/api/items/item.controller.ts:102:47
   })
   async getAllItems(
     @Query() query: FindItemsParamsDTO,
-  ): Promise<{ data: Item[]; total: number }> {
-    return await this.itemService.getAllItems(query);
-  }
+  ): Promise<{ data: Item[]; total: number }> {}
 }
 
killedBy: ItemController getAllItems should return a list of items
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
