[Killed] BlockStatement
src/api/items/item.service.ts:13:55
   private readonly logger = new Logger(ItemService.name);
   private readonly itemRepo: Prisma.ItemDelegate;
 
-  constructor(private readonly prisma: PrismaService) {
-    this.itemRepo = prisma.item;
-  }
+  constructor(private readonly prisma: PrismaService) {}
 
   async createItem(createItemDto: CreateItemDTO): Promise<Item> {
killedBy: ItemService createItem should create an item
statusReason: TypeError: Cannot read properties of undefined (reading 'create')

[Killed] BlockStatement
src/api/items/item.service.ts:17:65
     this.itemRepo = prisma.item;
   }
 
-  async createItem(createItemDto: CreateItemDTO): Promise<Item> {
-    const item = await this.itemRepo.create({
-      data: createItemDto,
-    });
-    this.logger.log(`Item created with id: ${item.id}`);
-    return item;
-  }
+  async createItem(createItemDto: CreateItemDTO): Promise<Item> {}
 
   async getItemById(id: string): Promise<Item> {
killedBy: ItemService createItem should create an item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/items/item.service.ts:25:48
     return item;
   }
 
-  async getItemById(id: string): Promise<Item> {
-    const item = await this.itemRepo.findUnique({ where: { id } });
-    if (!item) throw new NotFoundException(`Item with ID ${id} not found`);
-    return item;
-  }
+  async getItemById(id: string): Promise<Item> {}
 
   async updateItem(id: string, updateItemDto: UpdateItemDTO): Promise<Item> {
killedBy: ItemService getItemById should return an item by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BooleanLiteral
src/api/items/item.service.ts:27:9
 
   async getItemById(id: string): Promise<Item> {
     const item = await this.itemRepo.findUnique({ where: { id } });
-    if (!item) throw new NotFoundException(`Item with ID ${id} not found`);
+    if (item) throw new NotFoundException(`Item with ID ${id} not found`);
     return item;
   }
killedBy: ItemService getItemById should return an item by ID
statusReason: NotFoundException: Item with ID item-id-1 not found

[Killed] ConditionalExpression
src/api/items/item.service.ts:27:9
 
   async getItemById(id: string): Promise<Item> {
     const item = await this.itemRepo.findUnique({ where: { id } });
-    if (!item) throw new NotFoundException(`Item with ID ${id} not found`);
+    if (false) throw new NotFoundException(`Item with ID ${id} not found`);
     return item;
   }
killedBy: ItemService getItemById should throw NotFoundException if item not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/api/items/item.service.ts:31:77
     return item;
   }
 
-  async updateItem(id: string, updateItemDto: UpdateItemDTO): Promise<Item> {
-    const item = await this.itemRepo.update({
-      where: { id },
-      data: updateItemDto,
-    });
-    this.logger.log(`Item updated with id: ${item.id}`);
-    return item;
-  }
+  async updateItem(id: string, updateItemDto: UpdateItemDTO): Promise<Item> {}
 
   async deleteItem(id: string): Promise<{ message: string }> {
killedBy: ItemService updateItem should update an item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Survived] StringLiteral
src/api/items/item.service.ts:36:21
       where: { id },
       data: updateItemDto,
     });
-    this.logger.log(`Item updated with id: ${item.id}`);
+    this.logger.log(``);
     return item;
   }

[Killed] BlockStatement
src/api/items/item.service.ts:40:62
     return item;
   }
 
-  async deleteItem(id: string): Promise<{ message: string }> {
-    await this.getItemById(id);
-    await this.itemRepo.delete({ where: { id } });
-    this.logger.log(`Item deleted with id: ${id}`);
-    return { message: `Item with id ${id} deleted successfully` };
-  }
+  async deleteItem(id: string): Promise<{ message: string }> {}
 
   async getAllItems(
killedBy: ItemService deleteItem should delete an item by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Item with id item-id-1 deleted successfully"}
Received: undefined

[Killed] ObjectLiteral
src/api/items/item.service.ts:42:41
 
   async deleteItem(id: string): Promise<{ message: string }> {
     await this.getItemById(id);
-    await this.itemRepo.delete({ where: { id } });
+    await this.itemRepo.delete({ where: {} });
     this.logger.log(`Item deleted with id: ${id}`);
     return { message: `Item with id ${id} deleted successfully` };
killedBy: ItemService deleteItem should delete an item by ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": "item-id-1",

[Killed] ObjectLiteral
src/api/items/item.service.ts:42:32
 
   async deleteItem(id: string): Promise<{ message: string }> {
     await this.getItemById(id);
-    await this.itemRepo.delete({ where: { id } });
+    await this.itemRepo.delete({});
     this.logger.log(`Item deleted with id: ${id}`);
     return { message: `Item with id ${id} deleted successfully` };
killedBy: ItemService deleteItem should delete an item by ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "item-id-1",

[Survived] StringLiteral
src/api/items/item.service.ts:43:21
   async deleteItem(id: string): Promise<{ message: string }> {
     await this.getItemById(id);
     await this.itemRepo.delete({ where: { id } });
-    this.logger.log(`Item deleted with id: ${id}`);
+    this.logger.log(``);
     return { message: `Item with id ${id} deleted successfully` };
   }

[Killed] ObjectLiteral
src/api/items/item.service.ts:62:19
       orderDirection,
     } = params;
 
-    const where = {
-      name: { contains: name },
-      sku: { contains: sku },
-      category: { contains: category },
-      manufacturer: { contains: manufacturer },
-      originCountry: { contains: originCountry },
-    };
+    const where = {};
 
     const items = await this.itemRepo.findMany({
killedBy: ItemService getAllItems should return a list of items with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,23 +2,7 @@
    "orderBy": Object {
      "createdAt": "asc",

[Killed] ObjectLiteral
src/api/items/item.service.ts:67:22
       sku: { contains: sku },
       category: { contains: category },
       manufacturer: { contains: manufacturer },
-      originCountry: { contains: originCountry },
+      originCountry: {},
     };
 
killedBy: ItemService getAllItems should return a list of items with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -12,13 +12,11 @@
        "contains": "Test Manufacturer",
      },

[Killed] ObjectLiteral
src/api/items/item.service.ts:70:48
       originCountry: { contains: originCountry },
     };
 
-    const items = await this.itemRepo.findMany({
-      where,
-      orderBy: {
-        [orderBy]: orderDirection,
-      },
-      skip: (page - 1) * pageSize,
-      take: pageSize,
-    });
+    const items = await this.itemRepo.findMany({});
 
     const total = await this.itemRepo.count({ where });
killedBy: ItemService getAllItems should return a list of items with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "orderBy": Object {
-     "createdAt": "asc",
