[Killed] BlockStatement
src/api/journal/journal.service.ts:13:38
 export class JournalService {
   private readonly userActionRepo: Prisma.UserActionDelegate;
 
-  constructor(prisma: PrismaService) {
-    this.userActionRepo = prisma.userAction;
-  }
+  constructor(prisma: PrismaService) {}
 
   async findUserActions(params: FindUserActionsParams) {
killedBy: JournalService createUserAction should record user action
statusReason: TypeError: Cannot read properties of undefined (reading 'create')

[Killed] ObjectLiteral
src/api/journal/journal.service.ts:58:12
       }),
       this.userActionRepo.count({ where }),
     ]);
-    return {
-      data: userActions,
-      total,
-    };
+    return {};
   }
 
killedBy: JournalService findUserActions should return a list of user actions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "data": Array [
-     Object {

[Killed] BlockStatement
src/api/journal/journal.service.ts:64:54
     };
   }
 
-  async createUserAction(data: CreateUserActionData) {
-    return await this.userActionRepo.create({ data });
-  }
+  async createUserAction(data: CreateUserActionData) {}
 }
 
killedBy: JournalService createUserAction should record user action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"action": "create", "createdAt": 2024-12-20T00:16:00.660Z, "id": "1", "ip": "14.2.32.124", "payload": {"key": "value"}, "userId": null}
Received: undefined

[Killed] ObjectLiteral
src/api/journal/journal.service.ts:65:45
   }
 
   async createUserAction(data: CreateUserActionData) {
-    return await this.userActionRepo.create({ data });
+    return await this.userActionRepo.create({});
   }
 }
killedBy: JournalService createUserAction should record user action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": Object {
-     "action": "create",
