[Killed] BlockStatement
src/api/role/role.controller.ts:45:21
   @ApiOkResponse({
     type: PermissionListDto,
   })
-  async findPerms() {
-    return this.roleService.findPerms();
-  }
+  async findPerms() {}
 
   @UserAction(Action.FIND_ROLES)
killedBy: RoleConstroller findPerms should return a list of permissions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["CREATE_ITEM", "UPDATE_ITEM", "DELETE_ITEM"]
Received: undefined

[Killed] BlockStatement
src/api/role/role.controller.ts:56:56
   @ApiOkResponse({
     type: RoleWithPermissionsListDto,
   })
-  async findRoles(@Query() params: FindRolesParamsDto) {
-    return this.roleService.findRoles(params);
-  }
+  async findRoles(@Query() params: FindRolesParamsDto) {}
 
   @UserAction(Action.FIND_ROLE)
killedBy: RoleConstroller findRoles should return a list of roles
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/role/role.controller.ts:71:43
     status: 404,
     description: 'Role not found',
   })
-  async findRole(@Param('id') id: string) {
-    return this.roleService.findRole(id);
-  }
+  async findRole(@Param('id') id: string) {}
 
   @UserAction(Action.CREATE_ROLE)
killedBy: RoleConstroller findRole should return a role by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2024-12-20T00:16:16.957Z, "id": "role-id-1", "name": "Admin", "permissions": ["CREATE_ITEM", "UPDATE_ITEM"], "updatedAt": 2024-12-20T00:16:16.957Z}
Received: undefined

[Killed] BlockStatement
src/api/role/role.controller.ts:83:53
     status: 201,
     type: RoleWithPermissionsDto,
   })
-  async createRole(@Body() data: CreateRoleDataDto) {
-    return this.roleService.createRole(data);
-  }
+  async createRole(@Body() data: CreateRoleDataDto) {}
 
   @UserAction(Action.UPDATE_ROLE)
killedBy: RoleConstroller createRole should create a new role
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2024-12-20T00:16:17.064Z, "id": "role-id-1", "name": "Admin", "permissions": ["CREATE_ITEM", "UPDATE_ITEM"], "updatedAt": 2024-12-20T00:16:17.064Z}
Received: undefined

[Killed] BlockStatement
src/api/role/role.controller.ts:98:78
     status: 404,
     description: 'Role not found',
   })
-  async updateRole(@Param('id') id: string, @Body() data: UpdateRoleDataDto) {
-    return this.roleService.updateRole(id, data);
-  }
+  async updateRole(@Param('id') id: string, @Body() data: UpdateRoleDataDto) {}
 
   @UserAction(Action.DELETE_ROLE)
killedBy: RoleConstroller updateRole should update a role by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": 2024-12-20T00:16:17.399Z, "id": "role-id-1", "name": "Updated Role", "permissionIds": [], "permissions": ["CREATE_ITEM", "UPDATE_ITEM"], "updatedAt": 2024-12-20T00:16:17.399Z}
Received: undefined

[Killed] BlockStatement
src/api/role/role.controller.ts:119:45
     status: 404,
     description: 'Role not found',
   })
-  async deleteRole(@Param('id') id: string) {
-    return await this.roleService.deleteRole(id);
-  }
+  async deleteRole(@Param('id') id: string) {}
 }
 
killedBy: RoleConstroller deleteRole should delete a role by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Role role-id-1 deleted successfully"}
Received: undefined
