[Killed] BlockStatement
src/api/user/user.mapper.ts:6:36
 
 @Injectable()
 export class UserMapper {
-  map(user: User & { role: Role }) {
-    const { password, ...userData } = user;
-    return userData;
-  }
+  map(user: User & { role: Role }) {}
 }
 
killedBy: UserService createUser should create a user
statusReason: Error: expect(received).toBeDefined()

Received: undefined
