[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:51:25
   })
   async createWarehouse(
     @Body() createWarehouseDto: CreateWarehouseDTO,
-  ): Promise<Warehouse> {
-    return await this.warehouseService.createWarehouse(createWarehouseDto);
-  }
+  ): Promise<Warehouse> {}
 
   @UserAction(Action.FIND_WEREHOUSE)
killedBy: WarehouseController createWarehouse should create a new warehouse
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:17.891Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:17.891Z}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:66:71
     status: 404,
     description: 'Warehouse not found',
   })
-  async getWarehouseById(@Param('id') id: string): Promise<Warehouse> {
-    return await this.warehouseService.getWarehouseById(id);
-  }
+  async getWarehouseById(@Param('id') id: string): Promise<Warehouse> {}
 
   @UserAction(Action.UPDATE_WEREHOUSE)
killedBy: WarehouseController getWarehouseById should return a warehouse by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:17.908Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:17.908Z}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:80:25
   async updateWarehouse(
     @Param('id') id: string,
     @Body() updateWarehouseDto: UpdateWarehouseDTO,
-  ): Promise<Warehouse> {
-    return await this.warehouseService.updateWarehouse(id, updateWarehouseDto);
-  }
+  ): Promise<Warehouse> {}
 
   @UserAction(Action.DELETE_WEREHOUSE)
killedBy: WarehouseController updateWarehouse should update a warehouse by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:17.982Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:17.982Z}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:97:80
       },
     },
   })
-  async deleteWarehouse(@Param('id') id: string): Promise<{ message: string }> {
-    return await this.warehouseService.deleteWarehouse(id);
-  }
+  async deleteWarehouse(@Param('id') id: string): Promise<{ message: string }> {}
 
   @UserAction(Action.FIND_WEREHOUSES)
killedBy: WarehouseController deleteWarehouse should delete a warehouse by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Warehouse deleted successfully"}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:110:52
   })
   async getAllWarehouses(
     @Query() query: FindWarehousesParamsDTO,
-  ): Promise<{ data: Warehouse[]; total: number }> {
-    return await this.warehouseService.getAllWarehouses(query);
-  }
+  ): Promise<{ data: Warehouse[]; total: number }> {}
 
   @UserAction(Action.CONNECT_USER_TO_WEREHOUSE)
killedBy: WarehouseController getAllWarehouses should return a list of warehouses
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:128:73
       },
     },
   })
-  async connectUserToWarehouse(@Body() data: ConnectUserToWarehouseDTO) {
-    return await this.warehouseService.connectUserToWarehouse(data);
-  }
+  async connectUserToWarehouse(@Body() data: ConnectUserToWarehouseDTO) {}
 
   @UserAction(Action.GET_USER_WEREHOUSES)
killedBy: WarehouseController connectUserToWarehouse should connect a user to a warehouse
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"userId": "user-id-1", "warehouseId": "warehouse-id-1"}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.controller.ts:141:51
   @ApiOkResponse({
     type: WerehouseListDto,
   })
-  async getUserWarehouses(): Promise<Warehouse[]> {
-    const userId = this.cls.get('user.id');
-    return await this.warehouseService.getWarehousesForUser(userId);
-  }
+  async getUserWarehouses(): Promise<Warehouse[]> {}
 }
 
killedBy: WarehouseController getUserWarehouses should return warehouses connected to the user
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
