[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:19:5
   constructor(
     prisma: PrismaService,
     private readonly userService: UserService,
-  ) {
-    this.warehouseRepo = prisma.warehouse;
-    this.userWarehouseRepo = prisma.userWarehouse;
-  }
+  ) {}
 
   async createWarehouse(createWarehouseDto: CreateWarehouseDTO) {
killedBy: WarehouseService createWarehouse should create a new warehouse
statusReason: TypeError: Cannot read properties of undefined (reading 'create')

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:24:65
     this.userWarehouseRepo = prisma.userWarehouse;
   }
 
-  async createWarehouse(createWarehouseDto: CreateWarehouseDTO) {
-    const warehouse = await this.warehouseRepo.create({
-      data: createWarehouseDto,
-    });
-    this.logger.log(`Warehouse created with id: ${warehouse.id}`);
-    return warehouse;
-  }
+  async createWarehouse(createWarehouseDto: CreateWarehouseDTO) {}
 
   async getWarehouseById(id: string) {
killedBy: WarehouseService createWarehouse should create a new warehouse
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:39.219Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:39.219Z}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:32:38
     return warehouse;
   }
 
-  async getWarehouseById(id: string) {
-    const warehouse = await this.warehouseRepo.findUnique({ where: { id } });
-    if (!warehouse)
-      throw new NotFoundException(`Warehouse with ID ${id} not found`);
-    return warehouse;
-  }
+  async getWarehouseById(id: string) {}
 
   async updateWarehouse(id: string, updateWarehouseDto: UpdateWarehouseDTO) {
killedBy: WarehouseService getWarehouseById should return a warehouse by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:39.469Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:39.469Z}
Received: undefined

[Killed] ObjectLiteral
src/api/warehouse/warehouse.service.ts:33:68
   }
 
   async getWarehouseById(id: string) {
-    const warehouse = await this.warehouseRepo.findUnique({ where: { id } });
+    const warehouse = await this.warehouseRepo.findUnique({ where: {} });
     if (!warehouse)
       throw new NotFoundException(`Warehouse with ID ${id} not found`);
killedBy: WarehouseService getWarehouseById should return a warehouse by ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": "warehouse-id-1",

[Killed] ObjectLiteral
src/api/warehouse/warehouse.service.ts:33:59
   }
 
   async getWarehouseById(id: string) {
-    const warehouse = await this.warehouseRepo.findUnique({ where: { id } });
+    const warehouse = await this.warehouseRepo.findUnique({});
     if (!warehouse)
       throw new NotFoundException(`Warehouse with ID ${id} not found`);
killedBy: WarehouseService getWarehouseById should return a warehouse by ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "warehouse-id-1",

[Killed] ConditionalExpression
src/api/warehouse/warehouse.service.ts:34:9
 
   async getWarehouseById(id: string) {
     const warehouse = await this.warehouseRepo.findUnique({ where: { id } });
-    if (!warehouse)
+    if (false)
       throw new NotFoundException(`Warehouse with ID ${id} not found`);
     return warehouse;
killedBy: WarehouseService getWarehouseById should throw NotFoundException if warehouse is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
src/api/warehouse/warehouse.service.ts:34:9
 
   async getWarehouseById(id: string) {
     const warehouse = await this.warehouseRepo.findUnique({ where: { id } });
-    if (!warehouse)
+    if (true)
       throw new NotFoundException(`Warehouse with ID ${id} not found`);
     return warehouse;
killedBy: WarehouseService getWarehouseById should return a warehouse by ID
statusReason: NotFoundException: Warehouse with ID warehouse-id-1 not found

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:39:77
     return warehouse;
   }
 
-  async updateWarehouse(id: string, updateWarehouseDto: UpdateWarehouseDTO) {
-    const warehouse = await this.warehouseRepo.update({
-      where: { id },
-      data: updateWarehouseDto,
-    });
-    this.logger.log(`Warehouse updated with id: ${warehouse.id}`);
-    return warehouse;
-  }
+  async updateWarehouse(id: string, updateWarehouseDto: UpdateWarehouseDTO) {}
 
   async deleteWarehouse(id: string) {
killedBy: WarehouseService updateWarehouse should update a warehouse by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:41.784Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:41.784Z}
Received: undefined

[Survived] StringLiteral
src/api/warehouse/warehouse.service.ts:44:21
       where: { id },
       data: updateWarehouseDto,
     });
-    this.logger.log(`Warehouse updated with id: ${warehouse.id}`);
+    this.logger.log(``);
     return warehouse;
   }

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:48:37
     return warehouse;
   }
 
-  async deleteWarehouse(id: string) {
-    await this.getWarehouseById(id);
-    await this.warehouseRepo.delete({ where: { id } });
-    this.logger.log(`Warehouse deleted with id: ${id}`);
-    return { message: `Warehouse with id ${id} deleted successfully` };
-  }
+  async deleteWarehouse(id: string) {}
 
   async getAllWarehouses(params: FindWarehousesParamsDTO) {
killedBy: WarehouseService deleteWarehouse should delete a warehouse by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Warehouse with id warehouse-id-1 deleted successfully"}
Received: undefined

[Survived] StringLiteral
src/api/warehouse/warehouse.service.ts:51:21
   async deleteWarehouse(id: string) {
     await this.getWarehouseById(id);
     await this.warehouseRepo.delete({ where: { id } });
-    this.logger.log(`Warehouse deleted with id: ${id}`);
+    this.logger.log(``);
     return { message: `Warehouse with id ${id} deleted successfully` };
   }

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:55:59
     return { message: `Warehouse with id ${id} deleted successfully` };
   }
 
-  async getAllWarehouses(params: FindWarehousesParamsDTO) {
-    const { name, type, isActive, page, pageSize, orderBy, orderDirection } =
-      params;
-
-    const where = {
-      name: { contains: name },
-      type: { contains: type },
-      isActive,
-    };
-
-    const warehouses = await this.warehouseRepo.findMany({
-      where,
-      orderBy: {
-        [orderBy]: orderDirection,
-      },
-      skip: (page - 1) * pageSize,
-      take: pageSize,
-    });
-
-    const total = await this.warehouseRepo.count({ where });
-    return {
-      data: warehouses,
-      total,
-    };
-  }
+  async getAllWarehouses(params: FindWarehousesParamsDTO) {}
 
   async connectUserToWarehouse({
killedBy: WarehouseService getAllWarehouses should return a list of warehouses with total count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": [{"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:46.105Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:46.105Z}], "total": 1}
Received: undefined

[Killed] ObjectLiteral
src/api/warehouse/warehouse.service.ts:59:19
     const { name, type, isActive, page, pageSize, orderBy, orderDirection } =
       params;
 
-    const where = {
-      name: { contains: name },
-      type: { contains: type },
-      isActive,
-    };
+    const where = {};
 
     const warehouses = await this.warehouseRepo.findMany({
killedBy: WarehouseService getAllWarehouses should return a list of warehouses with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,15 +2,7 @@
    "orderBy": Object {
      "createdAt": "asc",

[Killed] ObjectLiteral
src/api/warehouse/warehouse.service.ts:65:58
       isActive,
     };
 
-    const warehouses = await this.warehouseRepo.findMany({
-      where,
-      orderBy: {
-        [orderBy]: orderDirection,
-      },
-      skip: (page - 1) * pageSize,
-      take: pageSize,
-    });
+    const warehouses = await this.warehouseRepo.findMany({});
 
     const total = await this.warehouseRepo.count({ where });
killedBy: WarehouseService getAllWarehouses should return a list of warehouses with total count
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "orderBy": Object {
-     "createdAt": "asc",

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:84:33
   async connectUserToWarehouse({
     userId,
     warehouseId,
-  }: ConnectUserToWarehouseDTO) {
-    const user = await this.userService.findUser(userId);
-    const warehouse = await this.getWarehouseById(warehouseId);
-    const userWarehouse = await this.userWarehouseRepo.create({
-      data: {
-        userId: user.id,
-        warehouseId: warehouse.id,
-      },
-    });
-    this.logger.log(
-      `User ${userId} connected to Warehouse ${warehouseId} in user_warehouses`,
-    );
-    return userWarehouse;
-  }
+  }: ConnectUserToWarehouseDTO) {}
 
   async getWarehousesForUser(userId: string) {
killedBy: WarehouseService connectUserToWarehouse should connect a user to a warehouse
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"userId": "user-id-1", "warehouseId": "warehouse-id-1"}
Received: undefined

[Killed] BlockStatement
src/api/warehouse/warehouse.service.ts:99:46
     return userWarehouse;
   }
 
-  async getWarehousesForUser(userId: string) {
-    await this.userService.findUser(userId);
-
-    const warehouses = await this.userWarehouseRepo.findMany({
-      where: { userId },
-      include: {
-        warehouse: true,
-      },
-    });
-
-    this.logger.log(`Fetched warehouses for user ${userId}`);
-    return warehouses.map((userWarehouse) => userWarehouse.warehouse);
-  }
+  async getWarehousesForUser(userId: string) {}
 }
 
killedBy: WarehouseService getWarehousesForUser should return warehouses connected to the user
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"address": "123 Test St", "area": 1000, "coordinates": "0,0", "createdAt": 2024-12-20T00:20:51.474Z, "id": "warehouse-id-1", "isActive": true, "name": "Test Warehouse", "notes": "Test notes", "photo": null, "type": "Storage", "updatedAt": 2024-12-20T00:20:51.474Z}]
Received: undefined

[Killed] BooleanLiteral
src/api/warehouse/warehouse.service.ts:105:20
     const warehouses = await this.userWarehouseRepo.findMany({
       where: { userId },
       include: {
-        warehouse: true,
+        warehouse: false,
       },
     });
killedBy: WarehouseService getWarehousesForUser should return warehouses connected to the user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "include": Object {
-     "warehouse": true,

[Killed] ArrowFunction
src/api/warehouse/warehouse.service.ts:110:27
     });
 
     this.logger.log(`Fetched warehouses for user ${userId}`);
-    return warehouses.map((userWarehouse) => userWarehouse.warehouse);
+    return warehouses.map(() => undefined);
   }
 }
killedBy: WarehouseService getWarehousesForUser should return warehouses connected to the user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

  Array [
-   Object {
-     "address": "123 Test St",
